/* automatically generated by rust-bindgen */

pub const _GLIBCXX_MATH_H: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_CXX_CONFIG_H: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_RELEASE: ::std::os::raw::c_uint = 7;
pub const __GLIBCXX__: ::std::os::raw::c_uint = 20170630;
pub const _GLIBCXX_HAVE_ATTRIBUTE_VISIBILITY: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_USE_DEPRECATED: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_EXTERN_TEMPLATE: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_USE_DUAL_ABI: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_USE_CXX11_ABI: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_INLINE_VERSION: ::std::os::raw::c_uint = 0;
pub const _GLIBCXX_USE_ALLOCATOR_NEW: ::std::os::raw::c_uint = 1;
pub const _GLIBCXX_OS_DEFINES: ::std::os::raw::c_uint = 1;
pub const __NO_CTYPE: ::std::os::raw::c_uint = 1;
pub const _FEATURES_H: ::std::os::raw::c_uint = 1;
pub const _ISOC95_SOURCE: ::std::os::raw::c_uint = 1;
pub const _ISOC99_SOURCE: ::std::os::raw::c_uint = 1;
pub const _ISOC11_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_SOURCE: ::std::os::raw::c_uint = 1;
pub const _POSIX_C_SOURCE: ::std::os::raw::c_uint = 200809;
pub const _XOPEN_SOURCE: ::std::os::raw::c_uint = 700;
pub const _XOPEN_SOURCE_EXTENDED: ::std::os::raw::c_uint = 1;
pub const _LARGEFILE64_SOURCE: ::std::os::raw::c_uint = 1;
pub const _DEFAULT_SOURCE: ::std::os::raw::c_uint = 1;
pub const _ATFILE_SOURCE: ::std::os::raw::c_uint = 1;

pub const MAX_NUM_PARTS_IN_BITS: ::std::os::raw::c_uint = 10;
pub const _MEMORY_H: ::std::os::raw::c_uint = 1;
pub const _STRING_H: ::std::os::raw::c_uint = 1;
pub const BT_HEADER_LENGTH: ::std::os::raw::c_uint = 12;
pub const TRI_INFO_V0V1_CONVEX: ::std::os::raw::c_uint = 1;
pub const TRI_INFO_V1V2_CONVEX: ::std::os::raw::c_uint = 2;
pub const TRI_INFO_V2V0_CONVEX: ::std::os::raw::c_uint = 4;
pub const TRI_INFO_V0V1_SWAP_NORMALB: ::std::os::raw::c_uint = 8;
pub const TRI_INFO_V1V2_SWAP_NORMALB: ::std::os::raw::c_uint = 16;
pub const TRI_INFO_V2V0_SWAP_NORMALB: ::std::os::raw::c_uint = 32;
pub const DBVT_IMPL_GENERIC: ::std::os::raw::c_uint = 0;
pub const DBVT_IMPL_SSE: ::std::os::raw::c_uint = 1;
pub const DBVT_USE_TEMPLATE: ::std::os::raw::c_uint = 0;
pub const DBVT_USE_INTRINSIC_SSE: ::std::os::raw::c_uint = 1;
pub const DBVT_USE_MEMMOVE: ::std::os::raw::c_uint = 1;
pub const DBVT_ENABLE_BENCHMARK: ::std::os::raw::c_uint = 0;
pub const DBVT_SELECT_IMPL: ::std::os::raw::c_uint = 0;
pub const DBVT_MERGE_IMPL: ::std::os::raw::c_uint = 0;
pub const DBVT_INT0_IMPL: ::std::os::raw::c_uint = 0;
pub const DBVT_BP_PROFILE: ::std::os::raw::c_uint = 0;
pub const DBVT_BP_PREVENTFALSEUPDATE: ::std::os::raw::c_uint = 0;
pub const DBVT_BP_ACCURATESLEEPING: ::std::os::raw::c_uint = 0;
pub const DBVT_BP_ENABLE_BENCHMARK: ::std::os::raw::c_uint = 0;
pub const USE_OVERLAP_TEST_ON_REMOVES: ::std::os::raw::c_uint = 1;
pub const CLEAN_INVALID_PAIRS: ::std::os::raw::c_uint = 1;
pub const USE_BT_CLOCK: ::std::os::raw::c_uint = 1;
pub const btRigidBodyDataName: &'static [u8; 22usize] = b"btRigidBodyDoubleData\0";
pub const btTypedConstraintDataName: &'static [u8; 28usize] = b"btTypedConstraintDoubleData\0";
pub const btPoint2PointConstraintDataName: &'static [u8; 35usize] =
    b"btPoint2PointConstraintDoubleData2\0";
pub const _BT_USE_CENTER_LIMIT_: ::std::os::raw::c_uint = 1;
pub const btHingeConstraintDataName: &'static [u8; 29usize] = b"btHingeConstraintDoubleData2\0";
pub const btConeTwistConstraintDataName: &'static [u8; 32usize] =
    b"btConeTwistConstraintDoubleData\0";
pub const btGeneric6DofConstraintDataName: &'static [u8; 35usize] =
    b"btGeneric6DofConstraintDoubleData2\0";
pub const BT_6DOF_FLAGS_AXIS_SHIFT: ::std::os::raw::c_uint = 3;
pub const btSliderConstraintDataName: &'static [u8; 29usize] = b"btSliderConstraintDoubleData\0";
pub const btGeneric6DofSpringConstraintDataName: &'static [u8; 41usize] =
    b"btGeneric6DofSpringConstraintDoubleData2\0";
pub const btGeneric6DofSpring2ConstraintDataName: &'static [u8; 42usize] =
    b"btGeneric6DofSpring2ConstraintDoubleData2\0";
pub const BT_6DOF_FLAGS_AXIS_SHIFT2: ::std::os::raw::c_uint = 4;
pub const btGearConstraintDataName: &'static [u8; 27usize] = b"btGearConstraintDoubleData\0";
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___true_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___true_type() {
    assert_eq!(
        ::std::mem::size_of::<std___true_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___true_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___true_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___true_type))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___false_type {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std___false_type() {
    assert_eq!(
        ::std::mem::size_of::<std___false_type>(),
        1usize,
        concat!("Size of: ", stringify!(std___false_type))
    );
    assert_eq!(
        ::std::mem::align_of::<std___false_type>(),
        1usize,
        concat!("Alignment of ", stringify!(std___false_type))
    );
}
pub type std___truth_type___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___traitor {
    pub _address: u8,
}
pub const std___traitor___value: std___traitor__bindgen_ty_1 = 0;
pub type std___traitor__bindgen_ty_1 = i32;
pub type std___traitor___type = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___are_same {
    pub _address: u8,
}
pub const std___are_same___value: std___are_same__bindgen_ty_1 = 0;
pub type std___are_same__bindgen_ty_1 = i32;
pub type std___are_same___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_void {
    pub _address: u8,
}
pub const std___is_void___value: std___is_void__bindgen_ty_1 = 0;
pub type std___is_void__bindgen_ty_1 = i32;
pub type std___is_void___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_void_open0_void_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_void>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_void)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_void>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_void)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_integer {
    pub _address: u8,
}
pub const std___is_integer___value: std___is_integer__bindgen_ty_1 = 0;
pub type std___is_integer__bindgen_ty_1 = i32;
pub type std___is_integer___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_integer_open0_bool__close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_integer_open0_unsigned___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_integer>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_integer)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_integer>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_integer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_floating {
    pub _address: u8,
}
pub const std___is_floating___value: std___is_floating__bindgen_ty_1 = 0;
pub type std___is_floating__bindgen_ty_1 = i32;
pub type std___is_floating___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_floating_open0_float_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_floating>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_floating)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_floating>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_floating)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_floating_open0_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_floating>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_floating)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_floating>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_floating)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_floating_open0_long_double_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_floating>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_floating)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_floating>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_floating)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_pointer {
    pub _address: u8,
}
pub const std___is_pointer___value: std___is_pointer__bindgen_ty_1 = 0;
pub type std___is_pointer__bindgen_ty_1 = i32;
pub type std___is_pointer___type = std___false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_char {
    pub _address: u8,
}
pub const std___is_char___value: std___is_char__bindgen_ty_1 = 0;
pub type std___is_char__bindgen_ty_1 = i32;
pub type std___is_char___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_char_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_char>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_char)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_char>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_char)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_char_open0_wchar_t_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_char>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_char)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_char>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_char)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_byte {
    pub _address: u8,
}
pub const std___is_byte___value: std___is_byte__bindgen_ty_1 = 0;
pub type std___is_byte__bindgen_ty_1 = i32;
pub type std___is_byte___type = std___false_type;
#[test]
fn __bindgen_test_layout_std___is_byte_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_byte>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_byte)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_byte>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_byte)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_byte_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_byte>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_byte)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_byte>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_byte)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___is_byte_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___is_byte>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___is_byte)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___is_byte>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___is_byte)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std___is_move_iterator {
    pub _address: u8,
}
pub const std___is_move_iterator___value: std___is_move_iterator__bindgen_ty_1 = 0;
pub type std___is_move_iterator__bindgen_ty_1 = i32;
pub type std___is_move_iterator___type = std___false_type;
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_std_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9exceptionD0Ev"]
    pub fn std_exception_exception_destructor(this: *mut std_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9exception4whatEv"]
    pub fn std_exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_exception {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_exception() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_exception>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_exception))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_exception))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt13bad_exceptionD0Ev"]
    pub fn std_bad_exception_bad_exception_destructor(this: *mut std_bad_exception);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt13bad_exception4whatEv"]
    pub fn std_bad_exception_what(
        this: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_char;
}
pub type std_terminate_handler = ::std::option::Option<unsafe extern "C" fn()>;
pub type std_unexpected_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}_ZSt13set_terminatePFvvE"]
    pub fn std_set_terminate(arg1: std_terminate_handler) -> std_terminate_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt9terminatev"]
    pub fn std_terminate();
}
extern "C" {
    #[link_name = "\u{1}_ZSt14set_unexpectedPFvvE"]
    pub fn std_set_unexpected(arg1: std_unexpected_handler) -> std_unexpected_handler;
}
extern "C" {
    #[link_name = "\u{1}_ZSt10unexpectedv"]
    pub fn std_unexpected();
}
extern "C" {
    #[link_name = "\u{1}_ZSt18uncaught_exceptionv"]
    pub fn std_uncaught_exception() -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZSt19uncaught_exceptionsv"]
    pub fn std_uncaught_exceptions() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_alloc {
    pub _base: std_exception,
}
#[test]
fn bindgen_test_layout_std_bad_alloc() {
    assert_eq!(
        ::std::mem::size_of::<std_bad_alloc>(),
        8usize,
        concat!("Size of: ", stringify!(std_bad_alloc))
    );
    assert_eq!(
        ::std::mem::align_of::<std_bad_alloc>(),
        8usize,
        concat!("Alignment of ", stringify!(std_bad_alloc))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNSt9bad_allocD0Ev"]
    pub fn std_bad_alloc_bad_alloc_destructor(this: *mut std_bad_alloc);
}
extern "C" {
    #[link_name = "\u{1}_ZNKSt9bad_alloc4whatEv"]
    pub fn std_bad_alloc_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_nothrow_t {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_std_nothrow_t() {
    assert_eq!(
        ::std::mem::size_of::<std_nothrow_t>(),
        1usize,
        concat!("Size of: ", stringify!(std_nothrow_t))
    );
    assert_eq!(
        ::std::mem::align_of::<std_nothrow_t>(),
        1usize,
        concat!("Alignment of ", stringify!(std_nothrow_t))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZSt7nothrow"]
    pub static mut std_nothrow: std_nothrow_t;
}
pub type std_new_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}_ZSt15set_new_handlerPFvvE"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
pub type __gnu_cxx___conditional_type___type<_Iftrue> = _Iftrue;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___add_unsigned {
    pub _address: u8,
}
pub type __gnu_cxx___add_unsigned___if_type = u8;
pub type __gnu_cxx___add_unsigned___type = __gnu_cxx___add_unsigned___if_type;
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_signed_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___add_unsigned_open0_long_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___add_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___add_unsigned)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___remove_unsigned {
    pub _address: u8,
}
pub type __gnu_cxx___remove_unsigned___if_type = u8;
pub type __gnu_cxx___remove_unsigned___type = __gnu_cxx___remove_unsigned___if_type;
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_char_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_short_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_int_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_long_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
#[test]
fn __bindgen_test_layout___gnu_cxx___remove_unsigned_open0_unsigned_long_long_close0_instantiation()
{
    assert_eq!(
        ::std::mem::size_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__gnu_cxx___remove_unsigned>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(__gnu_cxx___remove_unsigned)
        )
    );
}
pub type __gnu_cxx___promote___type = f64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_2 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_2___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_3 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_3___type<_Tp2> = _Tp2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __gnu_cxx___promote_4 {
    pub _address: u8,
}
pub type __gnu_cxx___promote_4___type<_Tp2> = _Tp2;
extern "C" {
    #[link_name = "\u{1}_ZN9__gnu_cxx27__verbose_terminate_handlerEv"]
    pub fn __gnu_cxx___verbose_terminate_handler();
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __fsid_t)).__val as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type float_t = f32;
pub type double_t = f64;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn sincos(__x: f64, __sinx: *mut f64, __cosx: *mut f64);
}
extern "C" {
    pub fn __sincos(__x: f64, __sinx: *mut f64, __cosx: *mut f64);
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn __log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn exp10(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp10(__x: f64) -> f64;
}
extern "C" {
    pub fn pow10(__x: f64) -> f64;
}
extern "C" {
    pub fn __pow10(__x: f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nexttoward(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nextdown(__x: f64) -> f64;
}
extern "C" {
    pub fn __nextdown(__x: f64) -> f64;
}
extern "C" {
    pub fn nextup(__x: f64) -> f64;
}
extern "C" {
    pub fn __nextup(__x: f64) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn llogb(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __llogb(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn __round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn roundeven(__x: f64) -> f64;
}
extern "C" {
    pub fn __roundeven(__x: f64) -> f64;
}
extern "C" {
    pub fn fromfp(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn __fromfp(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn ufromfp(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn __ufromfp(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn fromfpx(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn __fromfpx(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn ufromfpx(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn __ufromfpx(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn fmaxmag(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmaxmag(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fminmag(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fminmag(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn totalorder(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn totalordermag(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalize(__cx: *mut f64, __x: *const f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpayload(__x: *const f64) -> f64;
}
extern "C" {
    pub fn __getpayload(__x: *const f64) -> f64;
}
extern "C" {
    pub fn setpayload(__x: *mut f64, __payload: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpayloadsig(__x: *mut f64, __payload: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn sincosf(__x: f32, __sinx: *mut f32, __cosx: *mut f32);
}
extern "C" {
    pub fn __sincosf(__x: f32, __sinx: *mut f32, __cosx: *mut f32);
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn exp10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp10f(__x: f32) -> f32;
}
extern "C" {
    pub fn pow10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __pow10f(__x: f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nexttowardf(__x: f32, __y: f64) -> f32;
}
extern "C" {
    pub fn __nexttowardf(__x: f32, __y: f64) -> f32;
}
extern "C" {
    pub fn nextdownf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nextdownf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextupf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nextupf(__x: f32) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn llogbf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __llogbf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn roundevenf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundevenf(__x: f32) -> f32;
}
extern "C" {
    pub fn fromfpf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn __fromfpf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn ufromfpf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn __ufromfpf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn fromfpxf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn __fromfpxf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn ufromfpxf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn __ufromfpxf(
        __x: f32,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn fmaxmagf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmaxmagf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminmagf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fminmagf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn totalorderf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn totalordermagf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalizef(__cx: *mut f32, __x: *const f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpayloadf(__x: *const f32) -> f32;
}
extern "C" {
    pub fn __getpayloadf(__x: *const f32) -> f32;
}
extern "C" {
    pub fn setpayloadf(__x: *mut f32, __payload: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpayloadsigf(__x: *mut f32, __payload: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn acosl(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosl(__x: f64) -> f64;
}
extern "C" {
    pub fn asinl(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinl(__x: f64) -> f64;
}
extern "C" {
    pub fn atanl(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanl(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2l(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2l(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cosl(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosl(__x: f64) -> f64;
}
extern "C" {
    pub fn sinl(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinl(__x: f64) -> f64;
}
extern "C" {
    pub fn tanl(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanl(__x: f64) -> f64;
}
extern "C" {
    pub fn coshl(__x: f64) -> f64;
}
extern "C" {
    pub fn __coshl(__x: f64) -> f64;
}
extern "C" {
    pub fn sinhl(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinhl(__x: f64) -> f64;
}
extern "C" {
    pub fn tanhl(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanhl(__x: f64) -> f64;
}
extern "C" {
    pub fn sincosl(__x: f64, __sinx: *mut f64, __cosx: *mut f64);
}
extern "C" {
    pub fn __sincosl(__x: f64, __sinx: *mut f64, __cosx: *mut f64);
}
extern "C" {
    pub fn acoshl(__x: f64) -> f64;
}
extern "C" {
    pub fn __acoshl(__x: f64) -> f64;
}
extern "C" {
    pub fn asinhl(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinhl(__x: f64) -> f64;
}
extern "C" {
    pub fn atanhl(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanhl(__x: f64) -> f64;
}
extern "C" {
    pub fn expl(__x: f64) -> f64;
}
extern "C" {
    pub fn __expl(__x: f64) -> f64;
}
extern "C" {
    pub fn frexpl(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __frexpl(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexpl(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __ldexpl(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn logl(__x: f64) -> f64;
}
extern "C" {
    pub fn __logl(__x: f64) -> f64;
}
extern "C" {
    pub fn log10l(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10l(__x: f64) -> f64;
}
extern "C" {
    pub fn modfl(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modfl(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn exp10l(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp10l(__x: f64) -> f64;
}
extern "C" {
    pub fn pow10l(__x: f64) -> f64;
}
extern "C" {
    pub fn __pow10l(__x: f64) -> f64;
}
extern "C" {
    pub fn expm1l(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1l(__x: f64) -> f64;
}
extern "C" {
    pub fn log1pl(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1pl(__x: f64) -> f64;
}
extern "C" {
    pub fn logbl(__x: f64) -> f64;
}
extern "C" {
    pub fn __logbl(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2l(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2l(__x: f64) -> f64;
}
extern "C" {
    pub fn log2l(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2l(__x: f64) -> f64;
}
extern "C" {
    pub fn powl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __powl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrtl(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrtl(__x: f64) -> f64;
}
extern "C" {
    pub fn hypotl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypotl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrtl(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrtl(__x: f64) -> f64;
}
extern "C" {
    pub fn ceill(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceill(__x: f64) -> f64;
}
extern "C" {
    pub fn fabsl(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabsl(__x: f64) -> f64;
}
extern "C" {
    pub fn floorl(__x: f64) -> f64;
}
extern "C" {
    pub fn __floorl(__x: f64) -> f64;
}
extern "C" {
    pub fn fmodl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmodl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __isinfl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitel(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isinfl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitel(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dreml(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __dreml(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significandl(__x: f64) -> f64;
}
extern "C" {
    pub fn __significandl(__x: f64) -> f64;
}
extern "C" {
    pub fn copysignl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysignl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __isnanl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isnanl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0l(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0l(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1l(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1l(arg1: f64) -> f64;
}
extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0l(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0l(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1l(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1l(arg1: f64) -> f64;
}
extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erfl(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfl(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfcl(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfcl(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn gammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gammal(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgammal_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __lgammal_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rintl(__x: f64) -> f64;
}
extern "C" {
    pub fn __rintl(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafterl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafterl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttowardl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nexttowardl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nextdownl(__x: f64) -> f64;
}
extern "C" {
    pub fn __nextdownl(__x: f64) -> f64;
}
extern "C" {
    pub fn nextupl(__x: f64) -> f64;
}
extern "C" {
    pub fn __nextupl(__x: f64) -> f64;
}
extern "C" {
    pub fn remainderl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainderl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbnl(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __scalbnl(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ilogbl(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbl(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn llogbl(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __llogbl(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn scalblnl(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn __scalblnl(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn nearbyintl(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyintl(__x: f64) -> f64;
}
extern "C" {
    pub fn roundl(__x: f64) -> f64;
}
extern "C" {
    pub fn __roundl(__x: f64) -> f64;
}
extern "C" {
    pub fn truncl(__x: f64) -> f64;
}
extern "C" {
    pub fn __truncl(__x: f64) -> f64;
}
extern "C" {
    pub fn remquol(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __remquol(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lrintl(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintl(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintl(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintl(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundl(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundl(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundl(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundl(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdiml(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdiml(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmaxl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmaxl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fminl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fminl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fpclassifyl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fmal(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fmal(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn roundevenl(__x: f64) -> f64;
}
extern "C" {
    pub fn __roundevenl(__x: f64) -> f64;
}
extern "C" {
    pub fn fromfpl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn __fromfpl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn ufromfpl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn __ufromfpl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn fromfpxl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn __fromfpxl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __intmax_t;
}
extern "C" {
    pub fn ufromfpxl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn __ufromfpxl(
        __x: f64,
        __round: ::std::os::raw::c_int,
        __width: ::std::os::raw::c_uint,
    ) -> __uintmax_t;
}
extern "C" {
    pub fn fmaxmagl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmaxmagl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fminmagl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fminmagl(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __iseqsigl(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingl(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn totalorderl(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn totalordermagl(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalizel(__cx: *mut f64, __x: *const f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpayloadl(__x: *const f64) -> f64;
}
extern "C" {
    pub fn __getpayloadl(__x: *const f64) -> f64;
}
extern "C" {
    pub fn setpayloadl(__x: *mut f64, __payload: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setpayloadsigl(__x: *mut f64, __payload: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalbl(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalbl(__x: f64, __n: f64) -> f64;
}
extern "C" {
    #[link_name = "\u{1}signgam"]
    pub static mut signgam: ::std::os::raw::c_int;
}
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
extern "C" {
    pub fn __iscanonicall(__x: f64) -> ::std::os::raw::c_int;
}
pub const _LIB_VERSION_TYPE__IEEE_: _LIB_VERSION_TYPE = -1;
pub const _LIB_VERSION_TYPE__SVID_: _LIB_VERSION_TYPE = 0;
pub const _LIB_VERSION_TYPE__XOPEN_: _LIB_VERSION_TYPE = 1;
pub const _LIB_VERSION_TYPE__POSIX_: _LIB_VERSION_TYPE = 2;
pub const _LIB_VERSION_TYPE__ISOC_: _LIB_VERSION_TYPE = 3;
pub type _LIB_VERSION_TYPE = ::std::os::raw::c_int;
extern "C" {
    #[link_name = "\u{1}_LIB_VERSION"]
    pub static mut _LIB_VERSION: _LIB_VERSION_TYPE;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __exception {
    pub type_: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[test]
fn bindgen_test_layout___exception() {
    assert_eq!(
        ::std::mem::size_of::<__exception>(),
        40usize,
        concat!("Size of: ", stringify!(__exception))
    );
    assert_eq!(
        ::std::mem::align_of::<__exception>(),
        8usize,
        concat!("Alignment of ", stringify!(__exception))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __exception)).type_ as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__exception),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __exception)).name as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(__exception),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __exception)).arg1 as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(__exception),
            "::",
            stringify!(arg1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __exception)).arg2 as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(__exception),
            "::",
            stringify!(arg2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __exception)).retval as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(__exception),
            "::",
            stringify!(retval)
        )
    );
}
extern "C" {
    pub fn matherr(__exc: *mut __exception) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const div_t)).quot as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const div_t)).rem as *const _ as usize },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const ldiv_t)).quot as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const ldiv_t)).rem as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const lldiv_t)).quot as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const lldiv_t)).rem as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strfromd(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfroml(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __locale_struct)).__locales as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __locale_struct)).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Alignment of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __locale_struct)).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Alignment of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __locale_struct)).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Alignment of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __locale_struct)).__names as *const _ as usize },
        128usize,
        concat!(
            "Alignment of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strtol_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: __locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: __locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoll_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: __locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: __locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtod_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: __locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtof_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: __locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtold_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: __locale_t,
    ) -> f64;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __sigset_t)).__val as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(0 as *const timeval)).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const timeval)).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(0 as *const timespec)).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const timespec)).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(0 as *const fd_set)).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(
        __major: ::std::os::raw::c_uint,
        __minor: ::std::os::raw::c_uint,
    ) -> __dev_t;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_attr_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_attr_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __pthread_internal_list)).__prev as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __pthread_internal_list)).__next as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: pthread_mutex_t___pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t___pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_mutex_t___pthread_mutex_s)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__lock as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__count as *const _ as usize },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__owner as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__nusers as *const _ as usize
        },
        12usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__kind as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__spins as *const _ as usize },
        20usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__elision as *const _ as usize
        },
        22usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t___pthread_mutex_s)).__list as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t)).__data as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutex_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutexattr_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_mutexattr_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: pthread_cond_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __bindgen_anon_1: pthread_cond_t__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: pthread_cond_t__bindgen_ty_1__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t__bindgen_ty_1__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1)).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_1)).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_1)).__wseq32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t__bindgen_ty_1__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1)).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1)).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_2)).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1__bindgen_ty_2)).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t__bindgen_ty_1)).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t__bindgen_ty_1)).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_cond_t__bindgen_ty_1)).__g1_orig_size as *const _ as usize
        },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t__bindgen_ty_1)).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t__bindgen_ty_1)).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__g_signals)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t)).__data as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_cond_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_condattr_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_condattr_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: pthread_rwlock_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__readers as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__writers as *const _ as usize },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__shared as *const _ as usize },
        28usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t__bindgen_ty_1)).__flags as *const _ as usize },
        48usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__flags)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t)).__data as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlock_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlockattr_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_rwlockattr_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_barrier_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_barrier_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_barrierattr_t)).__size as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const pthread_barrierattr_t)).__align as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).fptr as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).rptr as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).state as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const random_data)).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(0 as *const drand48_data)).__x as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const drand48_data)).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Alignment of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const drand48_data)).__c as *const _ as usize },
        12usize,
        concat!(
            "Alignment of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const drand48_data)).__init as *const _ as usize },
        14usize,
        concat!(
            "Alignment of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const drand48_data)).__a as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn cfree(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn secure_getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp64(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkostemp(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemp64(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalize_file_name(
        __name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_void, arg2: *const ::std::os::raw::c_void)
        -> ::std::os::raw::c_int,
>;
pub type comparison_fn_t = __compar_fn_t;
pub type __compar_d_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_d_fn_t,
        __arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut u16,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut u16, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const u16, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *const ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setkey(__key: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn posix_openpt(__oflag: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn grantpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlockpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ptsname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ptsname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpt() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type btScalar = f64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct btInfMaskConverter {
    pub __bindgen_anon_1: btInfMaskConverter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union btInfMaskConverter__bindgen_ty_1 {
    pub mask: f32,
    pub intmask: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_btInfMaskConverter__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<btInfMaskConverter__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(btInfMaskConverter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<btInfMaskConverter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(btInfMaskConverter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btInfMaskConverter__bindgen_ty_1)).mask as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btInfMaskConverter__bindgen_ty_1),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btInfMaskConverter__bindgen_ty_1)).intmask as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btInfMaskConverter__bindgen_ty_1),
            "::",
            stringify!(intmask)
        )
    );
}
#[test]
fn bindgen_test_layout_btInfMaskConverter() {
    assert_eq!(
        ::std::mem::size_of::<btInfMaskConverter>(),
        4usize,
        concat!("Size of: ", stringify!(btInfMaskConverter))
    );
    assert_eq!(
        ::std::mem::align_of::<btInfMaskConverter>(),
        4usize,
        concat!("Alignment of ", stringify!(btInfMaskConverter))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZL14btInfinityMask"]
    pub static mut btInfinityMask: btInfMaskConverter;
}
/// rudimentary class to provide type info
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btTypedObject {
    pub m_objectType: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_btTypedObject() {
    assert_eq!(
        ::std::mem::size_of::<btTypedObject>(),
        4usize,
        concat!("Size of: ", stringify!(btTypedObject))
    );
    assert_eq!(
        ::std::mem::align_of::<btTypedObject>(),
        4usize,
        concat!("Alignment of ", stringify!(btTypedObject))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTypedObject)).m_objectType as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTypedObject),
            "::",
            stringify!(m_objectType)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_Z22btAlignedAllocInternalmi"]
    pub fn btAlignedAllocInternal(
        size: usize,
        alignment: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_Z21btAlignedFreeInternalPv"]
    pub fn btAlignedFreeInternal(ptr: *mut ::std::os::raw::c_void);
}
pub type size_type = ::std::os::raw::c_int;
pub type btAlignedAllocFunc = ::std::option::Option<
    unsafe extern "C" fn(size: usize, alignment: ::std::os::raw::c_int)
        -> *mut ::std::os::raw::c_void,
>;
pub type btAlignedFreeFunc = ::std::option::Option<
    unsafe extern "C" fn(memblock: *mut ::std::os::raw::c_void),
>;
pub type btAllocFunc = ::std::option::Option<
    unsafe extern "C" fn(size: usize) -> *mut ::std::os::raw::c_void,
>;
pub type btFreeFunc = ::std::option::Option<
    unsafe extern "C" fn(memblock: *mut ::std::os::raw::c_void),
>;
extern "C" {

    /// The developer can let all Bullet memory allocations go through a custom memory allocator, using btAlignedAllocSetCustom

    #[link_name = "\u{1}_Z23btAlignedAllocSetCustomPFPvmEPFvS_E"]
    pub fn btAlignedAllocSetCustom(allocFunc: btAllocFunc, freeFunc: btFreeFunc);
}
extern "C" {

    /// If the developer has already an custom aligned allocator, then btAlignedAllocSetCustomAligned can be used. The default aligned allocator pre-allocates extra memory using the non-aligned allocator, and instruments it.

    #[link_name = "\u{1}_Z30btAlignedAllocSetCustomAlignedPFPvmiEPFvS_E"]
    pub fn btAlignedAllocSetCustomAligned(
        allocFunc: btAlignedAllocFunc,
        freeFunc: btAlignedFreeFunc,
    );
}
pub type btAlignedAllocator_self_type = u8;
pub type btAlignedAllocator_const_pointer<T> = *mut T;
pub type btAlignedAllocator_const_reference<T> = *mut T;
pub type btAlignedAllocator_pointer<T> = *mut T;
pub type btAlignedAllocator_reference<T> = *mut T;
pub type btAlignedAllocator_value_type<T> = T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btAlignedAllocator_rebind {
    pub _address: u8,
}
pub type btAlignedAllocator_rebind_other = u8;
/// @brief btVector3 can be used to represent 3D points and vectors.
/// It has an un-used w component to suit 16-byte alignment when btVector3 is stored in containers. This extra component can be used by derived classes (Quaternion?) or by user
/// Ideally, this class should be replaced by a platform optimized SIMD version that keeps the data in registers
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btVector3 {
    pub m_floats: [btScalar; 4usize],
}
#[test]
fn bindgen_test_layout_btVector3() {
    assert_eq!(
        ::std::mem::size_of::<btVector3>(),
        32usize,
        concat!("Size of: ", stringify!(btVector3))
    );
    assert_eq!(
        ::std::mem::align_of::<btVector3>(),
        8usize,
        concat!("Alignment of ", stringify!(btVector3))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btVector3)).m_floats as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btVector3),
            "::",
            stringify!(m_floats)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btVector4 {
    pub _base: btVector3,
}
#[test]
fn bindgen_test_layout_btVector4() {
    assert_eq!(
        ::std::mem::size_of::<btVector4>(),
        32usize,
        concat!("Size of: ", stringify!(btVector4))
    );
    assert_eq!(
        ::std::mem::align_of::<btVector4>(),
        8usize,
        concat!("Alignment of ", stringify!(btVector4))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btVector3FloatData {
    pub m_floats: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_btVector3FloatData() {
    assert_eq!(
        ::std::mem::size_of::<btVector3FloatData>(),
        16usize,
        concat!("Size of: ", stringify!(btVector3FloatData))
    );
    assert_eq!(
        ::std::mem::align_of::<btVector3FloatData>(),
        4usize,
        concat!("Alignment of ", stringify!(btVector3FloatData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btVector3FloatData)).m_floats as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btVector3FloatData),
            "::",
            stringify!(m_floats)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btVector3DoubleData {
    pub m_floats: [f64; 4usize],
}
#[test]
fn bindgen_test_layout_btVector3DoubleData() {
    assert_eq!(
        ::std::mem::size_of::<btVector3DoubleData>(),
        32usize,
        concat!("Size of: ", stringify!(btVector3DoubleData))
    );
    assert_eq!(
        ::std::mem::align_of::<btVector3DoubleData>(),
        8usize,
        concat!("Alignment of ", stringify!(btVector3DoubleData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btVector3DoubleData)).m_floats as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btVector3DoubleData),
            "::",
            stringify!(m_floats)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btQuadWord {
    pub m_floats: [btScalar; 4usize],
}
#[test]
fn bindgen_test_layout_btQuadWord() {
    assert_eq!(
        ::std::mem::size_of::<btQuadWord>(),
        32usize,
        concat!("Size of: ", stringify!(btQuadWord))
    );
    assert_eq!(
        ::std::mem::align_of::<btQuadWord>(),
        8usize,
        concat!("Alignment of ", stringify!(btQuadWord))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btQuadWord)).m_floats as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btQuadWord),
            "::",
            stringify!(m_floats)
        )
    );
}
/// @brief The btQuaternion implements quaternion to perform linear algebra rotations in combination with btMatrix3x3, btVector3 and btTransform.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btQuaternion {
    pub _base: btQuadWord,
}
#[test]
fn bindgen_test_layout_btQuaternion() {
    assert_eq!(
        ::std::mem::size_of::<btQuaternion>(),
        32usize,
        concat!("Size of: ", stringify!(btQuaternion))
    );
    assert_eq!(
        ::std::mem::align_of::<btQuaternion>(),
        8usize,
        concat!("Alignment of ", stringify!(btQuaternion))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btQuaternionFloatData {
    pub m_floats: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_btQuaternionFloatData() {
    assert_eq!(
        ::std::mem::size_of::<btQuaternionFloatData>(),
        16usize,
        concat!("Size of: ", stringify!(btQuaternionFloatData))
    );
    assert_eq!(
        ::std::mem::align_of::<btQuaternionFloatData>(),
        4usize,
        concat!("Alignment of ", stringify!(btQuaternionFloatData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btQuaternionFloatData)).m_floats as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btQuaternionFloatData),
            "::",
            stringify!(m_floats)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btQuaternionDoubleData {
    pub m_floats: [f64; 4usize],
}
#[test]
fn bindgen_test_layout_btQuaternionDoubleData() {
    assert_eq!(
        ::std::mem::size_of::<btQuaternionDoubleData>(),
        32usize,
        concat!("Size of: ", stringify!(btQuaternionDoubleData))
    );
    assert_eq!(
        ::std::mem::align_of::<btQuaternionDoubleData>(),
        8usize,
        concat!("Alignment of ", stringify!(btQuaternionDoubleData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btQuaternionDoubleData)).m_floats as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btQuaternionDoubleData),
            "::",
            stringify!(m_floats)
        )
    );
}
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __mbstate_t__bindgen_ty_1)).__wch as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __mbstate_t__bindgen_ty_1)).__wchb as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const __mbstate_t)).__count as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const __mbstate_t)).__value as *const _ as usize },
        4usize,
        concat!(
            "Alignment of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const _G_fpos_t)).__pos as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _G_fpos_t)).__state as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const _G_fpos64_t)).__pos as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _G_fpos64_t)).__state as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        24usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_marker))._next as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_marker))._sbuf as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_marker))._pos as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._flags as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._markers as *const _ as usize },
        96usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._chain as *const _ as usize },
        104usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._lock as *const _ as usize },
        136usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._offset as *const _ as usize },
        144usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE)).__pad1 as *const _ as usize },
        152usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE)).__pad2 as *const _ as usize },
        160usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE)).__pad3 as *const _ as usize },
        168usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE)).__pad4 as *const _ as usize },
        176usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE)).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._mode as *const _ as usize },
        192usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_FILE))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "\u{1}_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void)
        -> ::std::os::raw::c_int,
>;
pub type cookie_read_function_t = __io_read_fn;
pub type cookie_write_function_t = __io_write_fn;
pub type cookie_seek_function_t = __io_seek_fn;
pub type cookie_close_function_t = __io_close_fn;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: __io_read_fn,
    pub write: __io_write_fn,
    pub seek: __io_seek_fn,
    pub close: __io_close_fn,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    assert_eq!(
        ::std::mem::size_of::<_IO_cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_cookie_io_functions_t)).read as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_cookie_io_functions_t)).write as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_cookie_io_functions_t)).seek as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const _IO_cookie_io_functions_t)).close as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_file {
    _unused: [u8; 0],
}
extern "C" {
    pub fn _IO_cookie_init(
        __cfile: *mut _IO_cookie_file,
        __read_write: ::std::os::raw::c_int,
        __cookie: *mut ::std::os::raw::c_void,
        __fns: _IO_cookie_io_functions_t,
    );
}
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int, arg3: __ssize_t)
        -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void, arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type fpos_t = _G_fpos_t;
pub type fpos64_t = _G_fpos64_t;
extern "C" {
    #[link_name = "\u{1}stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "\u{1}stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "\u{1}stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpfile64() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fopen64(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen64(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: _IO_cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: usize,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gets(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgets_unlocked(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __s: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fputs_unlocked(
        __s: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseeko64(
        __stream: *mut FILE,
        __off: __off64_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello64(__stream: *mut FILE) -> __off64_t;
}
extern "C" {
    pub fn fgetpos64(__stream: *mut FILE, __pos: *mut fpos64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos64(__stream: *mut FILE, __pos: *const fpos64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    #[link_name = "\u{1}_sys_nerr"]
    pub static mut _sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_sys_errlist"]
    pub static mut _sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cuserid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct obstack {
    _unused: [u8; 0],
}
extern "C" {
    pub fn obstack_printf(
        __obstack: *mut obstack,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn obstack_vprintf(
        __obstack: *mut obstack,
        __format: *const ::std::os::raw::c_char,
        __args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
/// @brief The btMatrix3x3 class implements a 3x3 rotation matrix, to perform linear algebra in combination with btQuaternion, btTransform and btVector3.
/// Make sure to only include a pure orthogonal matrix without scaling.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btMatrix3x3 {
    /// Data storage for the matrix, each vector is a row of the matrix
    pub m_el: [btVector3; 3usize],
}
#[test]
fn bindgen_test_layout_btMatrix3x3() {
    assert_eq!(
        ::std::mem::size_of::<btMatrix3x3>(),
        96usize,
        concat!("Size of: ", stringify!(btMatrix3x3))
    );
    assert_eq!(
        ::std::mem::align_of::<btMatrix3x3>(),
        8usize,
        concat!("Alignment of ", stringify!(btMatrix3x3))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btMatrix3x3)).m_el as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btMatrix3x3),
            "::",
            stringify!(m_el)
        )
    );
}
extern "C" {

    /// @brief Return the determinant of the matrix

    #[link_name = "\u{1}_ZNK11btMatrix3x311determinantEv"]
    pub fn btMatrix3x3_determinant(this: *const btMatrix3x3) -> btScalar;
}
extern "C" {

    /// @brief Return the adjoint of the matrix

    #[link_name = "\u{1}_ZNK11btMatrix3x37adjointEv"]
    pub fn btMatrix3x3_adjoint(this: *const btMatrix3x3) -> btMatrix3x3;
}
extern "C" {

    /// @brief Return the matrix with all values non negative

    #[link_name = "\u{1}_ZNK11btMatrix3x38absoluteEv"]
    pub fn btMatrix3x3_absolute(this: *const btMatrix3x3) -> btMatrix3x3;
}
extern "C" {

    /// @brief Return the transpose of the matrix

    #[link_name = "\u{1}_ZNK11btMatrix3x39transposeEv"]
    pub fn btMatrix3x3_transpose(this: *const btMatrix3x3) -> btMatrix3x3;
}
extern "C" {

    /// @brief Return the inverse of the matrix

    #[link_name = "\u{1}_ZNK11btMatrix3x37inverseEv"]
    pub fn btMatrix3x3_inverse(this: *const btMatrix3x3) -> btMatrix3x3;
}
extern "C" {
    #[link_name = "\u{1}_ZNK11btMatrix3x314transposeTimesERKS_"]
    pub fn btMatrix3x3_transposeTimes(
        this: *const btMatrix3x3,
        m: *const btMatrix3x3,
    ) -> btMatrix3x3;
}
extern "C" {
    #[link_name = "\u{1}_ZNK11btMatrix3x314timesTransposeERKS_"]
    pub fn btMatrix3x3_timesTranspose(
        this: *const btMatrix3x3,
        m: *const btMatrix3x3,
    ) -> btMatrix3x3;
}
extern "C" {
    #[link_name = "\u{1}_ZNK11btMatrix3x39serializeER21btMatrix3x3DoubleData"]
    pub fn btMatrix3x3_serialize(this: *const btMatrix3x3, dataOut: *mut btMatrix3x3DoubleData);
}
extern "C" {
    #[link_name = "\u{1}_ZNK11btMatrix3x314serializeFloatER20btMatrix3x3FloatData"]
    pub fn btMatrix3x3_serializeFloat(this: *const btMatrix3x3, dataOut: *mut btMatrix3x3FloatData);
}
extern "C" {
    #[link_name = "\u{1}_ZN11btMatrix3x311deSerializeERK21btMatrix3x3DoubleData"]
    pub fn btMatrix3x3_deSerialize(this: *mut btMatrix3x3, dataIn: *const btMatrix3x3DoubleData);
}
extern "C" {
    #[link_name = "\u{1}_ZN11btMatrix3x316deSerializeFloatERK20btMatrix3x3FloatData"]
    pub fn btMatrix3x3_deSerializeFloat(
        this: *mut btMatrix3x3,
        dataIn: *const btMatrix3x3FloatData,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN11btMatrix3x317deSerializeDoubleERK21btMatrix3x3DoubleData"]
    pub fn btMatrix3x3_deSerializeDouble(
        this: *mut btMatrix3x3,
        dataIn: *const btMatrix3x3DoubleData,
    );
}
impl btMatrix3x3 {
    #[inline]
    pub unsafe fn determinant(&self) -> btScalar {
        btMatrix3x3_determinant(self)
    }
    #[inline]
    pub unsafe fn adjoint(&self) -> btMatrix3x3 {
        btMatrix3x3_adjoint(self)
    }
    #[inline]
    pub unsafe fn absolute(&self) -> btMatrix3x3 {
        btMatrix3x3_absolute(self)
    }
    #[inline]
    pub unsafe fn transpose(&self) -> btMatrix3x3 {
        btMatrix3x3_transpose(self)
    }
    #[inline]
    pub unsafe fn inverse(&self) -> btMatrix3x3 {
        btMatrix3x3_inverse(self)
    }
    #[inline]
    pub unsafe fn transposeTimes(&self, m: *const btMatrix3x3) -> btMatrix3x3 {
        btMatrix3x3_transposeTimes(self, m)
    }
    #[inline]
    pub unsafe fn timesTranspose(&self, m: *const btMatrix3x3) -> btMatrix3x3 {
        btMatrix3x3_timesTranspose(self, m)
    }
    #[inline]
    pub unsafe fn serialize(&self, dataOut: *mut btMatrix3x3DoubleData) {
        btMatrix3x3_serialize(self, dataOut)
    }
    #[inline]
    pub unsafe fn serializeFloat(&self, dataOut: *mut btMatrix3x3FloatData) {
        btMatrix3x3_serializeFloat(self, dataOut)
    }
    #[inline]
    pub unsafe fn deSerialize(&mut self, dataIn: *const btMatrix3x3DoubleData) {
        btMatrix3x3_deSerialize(self, dataIn)
    }
    #[inline]
    pub unsafe fn deSerializeFloat(&mut self, dataIn: *const btMatrix3x3FloatData) {
        btMatrix3x3_deSerializeFloat(self, dataIn)
    }
    #[inline]
    pub unsafe fn deSerializeDouble(&mut self, dataIn: *const btMatrix3x3DoubleData) {
        btMatrix3x3_deSerializeDouble(self, dataIn)
    }
}
/// for serialization
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btMatrix3x3FloatData {
    pub m_el: [btVector3FloatData; 3usize],
}
#[test]
fn bindgen_test_layout_btMatrix3x3FloatData() {
    assert_eq!(
        ::std::mem::size_of::<btMatrix3x3FloatData>(),
        48usize,
        concat!("Size of: ", stringify!(btMatrix3x3FloatData))
    );
    assert_eq!(
        ::std::mem::align_of::<btMatrix3x3FloatData>(),
        4usize,
        concat!("Alignment of ", stringify!(btMatrix3x3FloatData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btMatrix3x3FloatData)).m_el as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btMatrix3x3FloatData),
            "::",
            stringify!(m_el)
        )
    );
}
/// for serialization
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btMatrix3x3DoubleData {
    pub m_el: [btVector3DoubleData; 3usize],
}
#[test]
fn bindgen_test_layout_btMatrix3x3DoubleData() {
    assert_eq!(
        ::std::mem::size_of::<btMatrix3x3DoubleData>(),
        96usize,
        concat!("Size of: ", stringify!(btMatrix3x3DoubleData))
    );
    assert_eq!(
        ::std::mem::align_of::<btMatrix3x3DoubleData>(),
        8usize,
        concat!("Alignment of ", stringify!(btMatrix3x3DoubleData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btMatrix3x3DoubleData)).m_el as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btMatrix3x3DoubleData),
            "::",
            stringify!(m_el)
        )
    );
}
/// @brief The btTransform class supports rigid transforms with only translation and rotation and no scaling/shear.
/// It can be used in combination with btVector3, btQuaternion and btMatrix3x3 linear algebra classes.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btTransform {
    /// Storage for the rotation
    pub m_basis: btMatrix3x3,
    /// Storage for the translation
    pub m_origin: btVector3,
}
#[test]
fn bindgen_test_layout_btTransform() {
    assert_eq!(
        ::std::mem::size_of::<btTransform>(),
        128usize,
        concat!("Size of: ", stringify!(btTransform))
    );
    assert_eq!(
        ::std::mem::align_of::<btTransform>(),
        8usize,
        concat!("Alignment of ", stringify!(btTransform))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTransform)).m_basis as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTransform),
            "::",
            stringify!(m_basis)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTransform)).m_origin as *const _ as usize },
        96usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTransform),
            "::",
            stringify!(m_origin)
        )
    );
}
extern "C" {

    /// @brief Return the inverse of this transform times the other transform
    /// @param t The other transform
    /// return this.inverse() * the other

    #[link_name = "\u{1}_ZNK11btTransform12inverseTimesERKS_"]
    pub fn btTransform_inverseTimes(this: *const btTransform, t: *const btTransform)
        -> btTransform;
}
extern "C" {
    #[link_name = "\u{1}_ZNK11btTransform9serializeER21btTransformDoubleData"]
    pub fn btTransform_serialize(this: *const btTransform, dataOut: *mut btTransformDoubleData);
}
extern "C" {
    #[link_name = "\u{1}_ZNK11btTransform14serializeFloatER20btTransformFloatData"]
    pub fn btTransform_serializeFloat(this: *const btTransform, dataOut: *mut btTransformFloatData);
}
extern "C" {
    #[link_name = "\u{1}_ZN11btTransform11deSerializeERK21btTransformDoubleData"]
    pub fn btTransform_deSerialize(this: *mut btTransform, dataIn: *const btTransformDoubleData);
}
extern "C" {
    #[link_name = "\u{1}_ZN11btTransform17deSerializeDoubleERK21btTransformDoubleData"]
    pub fn btTransform_deSerializeDouble(
        this: *mut btTransform,
        dataIn: *const btTransformDoubleData,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN11btTransform16deSerializeFloatERK20btTransformFloatData"]
    pub fn btTransform_deSerializeFloat(
        this: *mut btTransform,
        dataIn: *const btTransformFloatData,
    );
}
impl btTransform {
    #[inline]
    pub unsafe fn inverseTimes(&self, t: *const btTransform) -> btTransform {
        btTransform_inverseTimes(self, t)
    }
    #[inline]
    pub unsafe fn serialize(&self, dataOut: *mut btTransformDoubleData) {
        btTransform_serialize(self, dataOut)
    }
    #[inline]
    pub unsafe fn serializeFloat(&self, dataOut: *mut btTransformFloatData) {
        btTransform_serializeFloat(self, dataOut)
    }
    #[inline]
    pub unsafe fn deSerialize(&mut self, dataIn: *const btTransformDoubleData) {
        btTransform_deSerialize(self, dataIn)
    }
    #[inline]
    pub unsafe fn deSerializeDouble(&mut self, dataIn: *const btTransformDoubleData) {
        btTransform_deSerializeDouble(self, dataIn)
    }
    #[inline]
    pub unsafe fn deSerializeFloat(&mut self, dataIn: *const btTransformFloatData) {
        btTransform_deSerializeFloat(self, dataIn)
    }
}
/// for serialization
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btTransformFloatData {
    pub m_basis: btMatrix3x3FloatData,
    pub m_origin: btVector3FloatData,
}
#[test]
fn bindgen_test_layout_btTransformFloatData() {
    assert_eq!(
        ::std::mem::size_of::<btTransformFloatData>(),
        64usize,
        concat!("Size of: ", stringify!(btTransformFloatData))
    );
    assert_eq!(
        ::std::mem::align_of::<btTransformFloatData>(),
        4usize,
        concat!("Alignment of ", stringify!(btTransformFloatData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTransformFloatData)).m_basis as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTransformFloatData),
            "::",
            stringify!(m_basis)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTransformFloatData)).m_origin as *const _ as usize },
        48usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTransformFloatData),
            "::",
            stringify!(m_origin)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btTransformDoubleData {
    pub m_basis: btMatrix3x3DoubleData,
    pub m_origin: btVector3DoubleData,
}
#[test]
fn bindgen_test_layout_btTransformDoubleData() {
    assert_eq!(
        ::std::mem::size_of::<btTransformDoubleData>(),
        128usize,
        concat!("Size of: ", stringify!(btTransformDoubleData))
    );
    assert_eq!(
        ::std::mem::align_of::<btTransformDoubleData>(),
        8usize,
        concat!("Alignment of ", stringify!(btTransformDoubleData))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTransformDoubleData)).m_basis as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTransformDoubleData),
            "::",
            stringify!(m_basis)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btTransformDoubleData)).m_origin as *const _ as usize },
        96usize,
        concat!(
            "Alignment of field: ",
            stringify!(btTransformDoubleData),
            "::",
            stringify!(m_origin)
        )
    );
}
#[repr(C)]
pub struct btMotionState__bindgen_vtable(::std::os::raw::c_void);
/// The btMotionState interface class allows the dynamics world to synchronize and interpolate the updated world transforms with graphics
/// For optimizations, potentially only moving objects get synchronized (using setWorldPosition/setWorldOrientation)
#[repr(C)]
#[derive(Debug)]
pub struct btMotionState {
    pub vtable_: *const btMotionState__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_btMotionState() {
    assert_eq!(
        ::std::mem::size_of::<btMotionState>(),
        8usize,
        concat!("Size of: ", stringify!(btMotionState))
    );
    assert_eq!(
        ::std::mem::align_of::<btMotionState>(),
        8usize,
        concat!("Alignment of ", stringify!(btMotionState))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK13btMotionState17getWorldTransformER11btTransform"]
    pub fn btMotionState_getWorldTransform(
        this: *mut ::std::os::raw::c_void,
        worldTrans: *mut btTransform,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN13btMotionState17setWorldTransformERK11btTransform"]
    pub fn btMotionState_setWorldTransform(
        this: *mut ::std::os::raw::c_void,
        worldTrans: *const btTransform,
    );
}
/// The btAlignedObjectArray template class uses a subset of the stl::vector interface for its methods
/// It is developed to replace stl::vector to avoid portability issues, including STL alignment issues to add SIMD/SSE data
#[repr(C)]
#[derive(Debug)]
pub struct btAlignedObjectArray<T> {
    pub m_allocator: u8,
    pub m_size: ::std::os::raw::c_int,
    pub m_capacity: ::std::os::raw::c_int,
    pub m_data: *mut T,
    pub m_ownsMemory: bool,
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<T>>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btAlignedObjectArray_less {
    pub _address: u8,
}
pub type btCollisionObjectArray = btAlignedObjectArray<*mut btCollisionObject>;
#[repr(C)]
pub struct btCollisionObject__bindgen_vtable(::std::os::raw::c_void);
/// btCollisionObject can be used to manage collision detection objects.
/// btCollisionObject maintains all information that is needed for a collision detection: Shape, Transform and AABB proxy.
/// They can be added to the btCollisionWorld.
#[repr(C)]
#[derive(Debug)]
pub struct btCollisionObject {
    pub vtable_: *const btCollisionObject__bindgen_vtable,
    pub m_worldTransform: btTransform,
    /// m_interpolationWorldTransform is used for CCD and interpolation
    /// ///it can be either previous or future (predicted) transform
    pub m_interpolationWorldTransform: btTransform,
    pub m_interpolationLinearVelocity: btVector3,
    pub m_interpolationAngularVelocity: btVector3,
    pub m_anisotropicFriction: btVector3,
    pub m_hasAnisotropicFriction: ::std::os::raw::c_int,
    pub m_contactProcessingThreshold: btScalar,
    pub m_broadphaseHandle: *mut btBroadphaseProxy,
    pub m_collisionShape: *mut btCollisionShape,
    /// m_extensionPointer is used by some internal low-level Bullet extensions.
    pub m_extensionPointer: *mut ::std::os::raw::c_void,
    /// m_rootCollisionShape is temporarily used to store the original collision shape
    /// ///The m_collisionShape might be temporarily replaced by a child collision shape during collision detection purposes
    /// ///If it is NULL, the m_collisionShape is not temporarily replaced.
    pub m_rootCollisionShape: *mut btCollisionShape,
    pub m_collisionFlags: ::std::os::raw::c_int,
    pub m_islandTag1: ::std::os::raw::c_int,
    pub m_companionId: ::std::os::raw::c_int,
    pub m_worldArrayIndex: ::std::os::raw::c_int,
    pub m_activationState1: ::std::os::raw::c_int,
    pub m_deactivationTime: btScalar,
    pub m_friction: btScalar,
    pub m_restitution: btScalar,
    pub m_rollingFriction: btScalar,
    pub m_spinningFriction: btScalar,
    pub m_contactDamping: btScalar,
    pub m_contactStiffness: btScalar,
    /// m_internalType is reserved to distinguish Bullet's btCollisionObject, btRigidBody, btSoftBody, btGhostObject etc.
    /// ///do not assign your own m_internalType unless you write a new dynamics object class.
    pub m_internalType: ::std::os::raw::c_int,
    /// users can point to their objects, m_userPointer is not used by Bullet, see setUserPointer/getUserPointer
    pub m_userObjectPointer: *mut ::std::os::raw::c_void,
    pub m_userIndex2: ::std::os::raw::c_int,
    pub m_userIndex: ::std::os::raw::c_int,
    /// time of impact calculation
    pub m_hitFraction: btScalar,
    /// Swept sphere radius (0.0 by default), see btConvexConvexAlgorithm::
    pub m_ccdSweptSphereRadius: btScalar,
    /// Don't do continuous collision detection if the motion (in one step) is less then m_ccdMotionThreshold
    pub m_ccdMotionThreshold: btScalar,
    /// If some object should have elaborate collision filtering by sub-classes
    pub m_checkCollideWith: ::std::os::raw::c_int,
    pub m_objectsWithoutCollisionCheck: btAlignedObjectArray<*const btCollisionObject>,
    /// internal update revision number. It will be increased when the object changes. This allows some subsystems to perform lazy evaluation.
    pub m_updateRevision: ::std::os::raw::c_int,
    pub m_customDebugColorRGB: btVector3,
}
pub const btCollisionObject_CollisionFlags_CF_STATIC_OBJECT: btCollisionObject_CollisionFlags = 1;
pub const btCollisionObject_CollisionFlags_CF_KINEMATIC_OBJECT: btCollisionObject_CollisionFlags =
    2;
pub const btCollisionObject_CollisionFlags_CF_NO_CONTACT_RESPONSE : btCollisionObject_CollisionFlags = 4 ;
pub const btCollisionObject_CollisionFlags_CF_CUSTOM_MATERIAL_CALLBACK : btCollisionObject_CollisionFlags = 8 ;
pub const btCollisionObject_CollisionFlags_CF_CHARACTER_OBJECT: btCollisionObject_CollisionFlags =
    16;
pub const btCollisionObject_CollisionFlags_CF_DISABLE_VISUALIZE_OBJECT : btCollisionObject_CollisionFlags = 32 ;
pub const btCollisionObject_CollisionFlags_CF_DISABLE_SPU_COLLISION_PROCESSING : btCollisionObject_CollisionFlags = 64 ;
pub const btCollisionObject_CollisionFlags_CF_HAS_CONTACT_STIFFNESS_DAMPING : btCollisionObject_CollisionFlags = 128 ;
pub const btCollisionObject_CollisionFlags_CF_HAS_CUSTOM_DEBUG_RENDERING_COLOR : btCollisionObject_CollisionFlags = 256 ;
pub const btCollisionObject_CollisionFlags_CF_HAS_FRICTION_ANCHOR : btCollisionObject_CollisionFlags = 512 ;
pub const btCollisionObject_CollisionFlags_CF_HAS_COLLISION_SOUND_TRIGGER : btCollisionObject_CollisionFlags = 1024 ;
pub type btCollisionObject_CollisionFlags = ::std::os::raw::c_uint;
pub const btCollisionObject_CollisionObjectTypes_CO_COLLISION_OBJECT : btCollisionObject_CollisionObjectTypes = 1 ;
pub const btCollisionObject_CollisionObjectTypes_CO_RIGID_BODY : btCollisionObject_CollisionObjectTypes = 2 ;
pub const btCollisionObject_CollisionObjectTypes_CO_GHOST_OBJECT : btCollisionObject_CollisionObjectTypes = 4 ;
pub const btCollisionObject_CollisionObjectTypes_CO_SOFT_BODY : btCollisionObject_CollisionObjectTypes = 8 ;
pub const btCollisionObject_CollisionObjectTypes_CO_HF_FLUID : btCollisionObject_CollisionObjectTypes = 16 ;
pub const btCollisionObject_CollisionObjectTypes_CO_USER_TYPE : btCollisionObject_CollisionObjectTypes = 32 ;
pub const btCollisionObject_CollisionObjectTypes_CO_FEATHERSTONE_LINK : btCollisionObject_CollisionObjectTypes = 64 ;
pub type btCollisionObject_CollisionObjectTypes = ::std::os::raw::c_uint;
pub const btCollisionObject_AnisotropicFrictionFlags_CF_ANISOTROPIC_FRICTION_DISABLED : btCollisionObject_AnisotropicFrictionFlags = 0 ;
pub const btCollisionObject_AnisotropicFrictionFlags_CF_ANISOTROPIC_FRICTION : btCollisionObject_AnisotropicFrictionFlags = 1 ;
pub const btCollisionObject_AnisotropicFrictionFlags_CF_ANISOTROPIC_ROLLING_FRICTION : btCollisionObject_AnisotropicFrictionFlags = 2 ;
pub type btCollisionObject_AnisotropicFrictionFlags = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_btCollisionObject() {
    assert_eq!(
        ::std::mem::size_of::<btCollisionObject>(),
        616usize,
        concat!("Size of: ", stringify!(btCollisionObject))
    );
    assert_eq!(
        ::std::mem::align_of::<btCollisionObject>(),
        8usize,
        concat!("Alignment of ", stringify!(btCollisionObject))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_worldTransform as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_worldTransform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObject)).m_interpolationWorldTransform as *const _ as usize
        },
        136usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_interpolationWorldTransform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObject)).m_interpolationLinearVelocity as *const _ as usize
        },
        264usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_interpolationLinearVelocity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObject)).m_interpolationAngularVelocity as *const _ as usize
        },
        296usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_interpolationAngularVelocity)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_anisotropicFriction as *const _ as usize },
        328usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_anisotropicFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObject)).m_hasAnisotropicFriction as *const _ as usize
        },
        360usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_hasAnisotropicFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObject)).m_contactProcessingThreshold as *const _ as usize
        },
        368usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_contactProcessingThreshold)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_broadphaseHandle as *const _ as usize },
        376usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_broadphaseHandle)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_collisionShape as *const _ as usize },
        384usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_collisionShape)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_extensionPointer as *const _ as usize },
        392usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_extensionPointer)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_rootCollisionShape as *const _ as usize },
        400usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_rootCollisionShape)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_collisionFlags as *const _ as usize },
        408usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_collisionFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_islandTag1 as *const _ as usize },
        412usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_islandTag1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_companionId as *const _ as usize },
        416usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_companionId)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_worldArrayIndex as *const _ as usize },
        420usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_worldArrayIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_activationState1 as *const _ as usize },
        424usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_activationState1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_deactivationTime as *const _ as usize },
        432usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_deactivationTime)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_friction as *const _ as usize },
        440usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_friction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_restitution as *const _ as usize },
        448usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_restitution)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_rollingFriction as *const _ as usize },
        456usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_rollingFriction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_spinningFriction as *const _ as usize },
        464usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_spinningFriction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_contactDamping as *const _ as usize },
        472usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_contactDamping)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_contactStiffness as *const _ as usize },
        480usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_contactStiffness)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_internalType as *const _ as usize },
        488usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_internalType)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_userObjectPointer as *const _ as usize },
        496usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_userObjectPointer)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_userIndex2 as *const _ as usize },
        504usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_userIndex2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_userIndex as *const _ as usize },
        508usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_userIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_hitFraction as *const _ as usize },
        512usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_hitFraction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_ccdSweptSphereRadius as *const _ as usize },
        520usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_ccdSweptSphereRadius)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_ccdMotionThreshold as *const _ as usize },
        528usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_ccdMotionThreshold)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_checkCollideWith as *const _ as usize },
        536usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_checkCollideWith)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObject)).m_objectsWithoutCollisionCheck as *const _ as usize
        },
        544usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_objectsWithoutCollisionCheck)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_updateRevision as *const _ as usize },
        576usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_updateRevision)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObject)).m_customDebugColorRGB as *const _ as usize },
        584usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObject),
            "::",
            stringify!(m_customDebugColorRGB)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK17btCollisionObject18setActivationStateEi"]
    pub fn btCollisionObject_setActivationState(
        this: *const btCollisionObject,
        newState: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK17btCollisionObject20forceActivationStateEi"]
    pub fn btCollisionObject_forceActivationState(
        this: *const btCollisionObject,
        newState: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK17btCollisionObject8activateEb"]
    pub fn btCollisionObject_activate(this: *const btCollisionObject, forceActivation: bool);
}
extern "C" {
    #[link_name = "\u{1}_ZN17btCollisionObjectC1Ev"]
    pub fn btCollisionObject_btCollisionObject(this: *mut btCollisionObject);
}
impl btCollisionObject {
    #[inline]
    pub unsafe fn setActivationState(&self, newState: ::std::os::raw::c_int) {
        btCollisionObject_setActivationState(self, newState)
    }
    #[inline]
    pub unsafe fn forceActivationState(&self, newState: ::std::os::raw::c_int) {
        btCollisionObject_forceActivationState(self, newState)
    }
    #[inline]
    pub unsafe fn activate(&self, forceActivation: bool) {
        btCollisionObject_activate(self, forceActivation)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        btCollisionObject_btCollisionObject(&mut __bindgen_tmp);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN17btCollisionObjectD0Ev"]
    pub fn btCollisionObject_btCollisionObject_destructor(this: *mut btCollisionObject);
}
extern "C" {
    #[link_name = "\u{1}_ZNK17btCollisionObject28calculateSerializeBufferSizeEv"]
    pub fn btCollisionObject_calculateSerializeBufferSize(
        this: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {

    /// fills the dataBuffer and returns the struct name (and 0 on failure)

    #[link_name = "\u{1}_ZNK17btCollisionObject9serializeEPvP12btSerializer"]
    pub fn btCollisionObject_serialize(
        this: *mut ::std::os::raw::c_void,
        dataBuffer: *mut ::std::os::raw::c_void,
        serializer: *mut btSerializer,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}_ZNK17btCollisionObject21serializeSingleObjectEP12btSerializer"]
    pub fn btCollisionObject_serializeSingleObject(
        this: *mut ::std::os::raw::c_void,
        serializer: *mut btSerializer,
    );
}
/// do not change those serialization structures, it requires an updated sBulletDNAstr/sBulletDNAstr64
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btCollisionObjectDoubleData {
    pub m_broadphaseHandle: *mut ::std::os::raw::c_void,
    pub m_collisionShape: *mut ::std::os::raw::c_void,
    pub m_rootCollisionShape: *mut btCollisionShapeData,
    pub m_name: *mut ::std::os::raw::c_char,
    pub m_worldTransform: btTransformDoubleData,
    pub m_interpolationWorldTransform: btTransformDoubleData,
    pub m_interpolationLinearVelocity: btVector3DoubleData,
    pub m_interpolationAngularVelocity: btVector3DoubleData,
    pub m_anisotropicFriction: btVector3DoubleData,
    pub m_contactProcessingThreshold: f64,
    pub m_deactivationTime: f64,
    pub m_friction: f64,
    pub m_rollingFriction: f64,
    pub m_contactDamping: f64,
    pub m_contactStiffness: f64,
    pub m_restitution: f64,
    pub m_hitFraction: f64,
    pub m_ccdSweptSphereRadius: f64,
    pub m_ccdMotionThreshold: f64,
    pub m_hasAnisotropicFriction: ::std::os::raw::c_int,
    pub m_collisionFlags: ::std::os::raw::c_int,
    pub m_islandTag1: ::std::os::raw::c_int,
    pub m_companionId: ::std::os::raw::c_int,
    pub m_activationState1: ::std::os::raw::c_int,
    pub m_internalType: ::std::os::raw::c_int,
    pub m_checkCollideWith: ::std::os::raw::c_int,
    pub m_padding: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_btCollisionObjectDoubleData() {
    assert_eq!(
        ::std::mem::size_of::<btCollisionObjectDoubleData>(),
        496usize,
        concat!("Size of: ", stringify!(btCollisionObjectDoubleData))
    );
    assert_eq!(
        ::std::mem::align_of::<btCollisionObjectDoubleData>(),
        8usize,
        concat!("Alignment of ", stringify!(btCollisionObjectDoubleData))
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_broadphaseHandle as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_broadphaseHandle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_collisionShape as *const _ as usize
        },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_collisionShape)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_rootCollisionShape as *const _ as usize
        },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_rootCollisionShape)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_name as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_worldTransform as *const _ as usize
        },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_worldTransform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_interpolationWorldTransform as *const _
                as usize
        },
        160usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_interpolationWorldTransform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_interpolationLinearVelocity as *const _
                as usize
        },
        288usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_interpolationLinearVelocity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_interpolationAngularVelocity as *const _
                as usize
        },
        320usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_interpolationAngularVelocity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_anisotropicFriction as *const _ as usize
        },
        352usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_anisotropicFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_contactProcessingThreshold as *const _
                as usize
        },
        384usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_contactProcessingThreshold)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_deactivationTime as *const _ as usize
        },
        392usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_deactivationTime)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_friction as *const _ as usize },
        400usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_friction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_rollingFriction as *const _ as usize
        },
        408usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_rollingFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_contactDamping as *const _ as usize
        },
        416usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_contactDamping)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_contactStiffness as *const _ as usize
        },
        424usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_contactStiffness)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_restitution as *const _ as usize },
        432usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_restitution)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_hitFraction as *const _ as usize },
        440usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_hitFraction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_ccdSweptSphereRadius as *const _
                as usize
        },
        448usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_ccdSweptSphereRadius)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_ccdMotionThreshold as *const _ as usize
        },
        456usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_ccdMotionThreshold)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_hasAnisotropicFriction as *const _
                as usize
        },
        464usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_hasAnisotropicFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_collisionFlags as *const _ as usize
        },
        468usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_collisionFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_islandTag1 as *const _ as usize },
        472usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_islandTag1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_companionId as *const _ as usize },
        476usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_companionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_activationState1 as *const _ as usize
        },
        480usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_activationState1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_internalType as *const _ as usize
        },
        484usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_internalType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectDoubleData)).m_checkCollideWith as *const _ as usize
        },
        488usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_checkCollideWith)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectDoubleData)).m_padding as *const _ as usize },
        492usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectDoubleData),
            "::",
            stringify!(m_padding)
        )
    );
}
/// do not change those serialization structures, it requires an updated sBulletDNAstr/sBulletDNAstr64
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btCollisionObjectFloatData {
    pub m_broadphaseHandle: *mut ::std::os::raw::c_void,
    pub m_collisionShape: *mut ::std::os::raw::c_void,
    pub m_rootCollisionShape: *mut btCollisionShapeData,
    pub m_name: *mut ::std::os::raw::c_char,
    pub m_worldTransform: btTransformFloatData,
    pub m_interpolationWorldTransform: btTransformFloatData,
    pub m_interpolationLinearVelocity: btVector3FloatData,
    pub m_interpolationAngularVelocity: btVector3FloatData,
    pub m_anisotropicFriction: btVector3FloatData,
    pub m_contactProcessingThreshold: f32,
    pub m_deactivationTime: f32,
    pub m_friction: f32,
    pub m_rollingFriction: f32,
    pub m_contactDamping: f32,
    pub m_contactStiffness: f32,
    pub m_restitution: f32,
    pub m_hitFraction: f32,
    pub m_ccdSweptSphereRadius: f32,
    pub m_ccdMotionThreshold: f32,
    pub m_hasAnisotropicFriction: ::std::os::raw::c_int,
    pub m_collisionFlags: ::std::os::raw::c_int,
    pub m_islandTag1: ::std::os::raw::c_int,
    pub m_companionId: ::std::os::raw::c_int,
    pub m_activationState1: ::std::os::raw::c_int,
    pub m_internalType: ::std::os::raw::c_int,
    pub m_checkCollideWith: ::std::os::raw::c_int,
    pub m_padding: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_btCollisionObjectFloatData() {
    assert_eq!(
        ::std::mem::size_of::<btCollisionObjectFloatData>(),
        280usize,
        concat!("Size of: ", stringify!(btCollisionObjectFloatData))
    );
    assert_eq!(
        ::std::mem::align_of::<btCollisionObjectFloatData>(),
        8usize,
        concat!("Alignment of ", stringify!(btCollisionObjectFloatData))
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_broadphaseHandle as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_broadphaseHandle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_collisionShape as *const _ as usize
        },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_collisionShape)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_rootCollisionShape as *const _ as usize
        },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_rootCollisionShape)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_name as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_worldTransform as *const _ as usize
        },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_worldTransform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_interpolationWorldTransform as *const _
                as usize
        },
        96usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_interpolationWorldTransform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_interpolationLinearVelocity as *const _
                as usize
        },
        160usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_interpolationLinearVelocity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_interpolationAngularVelocity as *const _
                as usize
        },
        176usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_interpolationAngularVelocity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_anisotropicFriction as *const _ as usize
        },
        192usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_anisotropicFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_contactProcessingThreshold as *const _
                as usize
        },
        208usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_contactProcessingThreshold)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_deactivationTime as *const _ as usize
        },
        212usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_deactivationTime)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_friction as *const _ as usize },
        216usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_friction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_rollingFriction as *const _ as usize
        },
        220usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_rollingFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_contactDamping as *const _ as usize
        },
        224usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_contactDamping)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_contactStiffness as *const _ as usize
        },
        228usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_contactStiffness)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_restitution as *const _ as usize },
        232usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_restitution)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_hitFraction as *const _ as usize },
        236usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_hitFraction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_ccdSweptSphereRadius as *const _ as usize
        },
        240usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_ccdSweptSphereRadius)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_ccdMotionThreshold as *const _ as usize
        },
        244usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_ccdMotionThreshold)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_hasAnisotropicFriction as *const _
                as usize
        },
        248usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_hasAnisotropicFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_collisionFlags as *const _ as usize
        },
        252usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_collisionFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_islandTag1 as *const _ as usize },
        256usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_islandTag1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_companionId as *const _ as usize },
        260usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_companionId)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_activationState1 as *const _ as usize
        },
        264usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_activationState1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_internalType as *const _ as usize },
        268usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_internalType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectFloatData)).m_checkCollideWith as *const _ as usize
        },
        272usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_checkCollideWith)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectFloatData)).m_padding as *const _ as usize },
        276usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectFloatData),
            "::",
            stringify!(m_padding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btPoolAllocator {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btDispatcherInfo {
    pub m_timeStep: btScalar,
    pub m_stepCount: ::std::os::raw::c_int,
    pub m_dispatchFunc: ::std::os::raw::c_int,
    pub m_timeOfImpact: btScalar,
    pub m_useContinuous: bool,
    pub m_debugDraw: *mut btIDebugDraw,
    pub m_enableSatConvex: bool,
    pub m_enableSPU: bool,
    pub m_useEpa: bool,
    pub m_allowedCcdPenetration: btScalar,
    pub m_useConvexConservativeDistanceUtil: bool,
    pub m_convexConservativeDistanceThreshold: btScalar,
}
pub const btDispatcherInfo_DispatchFunc_DISPATCH_DISCRETE: btDispatcherInfo_DispatchFunc = 1;
pub const btDispatcherInfo_DispatchFunc_DISPATCH_CONTINUOUS: btDispatcherInfo_DispatchFunc = 2;
pub type btDispatcherInfo_DispatchFunc = ::std::os::raw::c_uint;
#[test]
fn bindgen_test_layout_btDispatcherInfo() {
    assert_eq!(
        ::std::mem::size_of::<btDispatcherInfo>(),
        72usize,
        concat!("Size of: ", stringify!(btDispatcherInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<btDispatcherInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(btDispatcherInfo))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_timeStep as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_timeStep)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_stepCount as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_stepCount)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_dispatchFunc as *const _ as usize },
        12usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_dispatchFunc)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_timeOfImpact as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_timeOfImpact)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_useContinuous as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_useContinuous)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_debugDraw as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_debugDraw)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_enableSatConvex as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_enableSatConvex)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_enableSPU as *const _ as usize },
        41usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_enableSPU)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_useEpa as *const _ as usize },
        42usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_useEpa)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btDispatcherInfo)).m_allowedCcdPenetration as *const _ as usize },
        48usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_allowedCcdPenetration)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btDispatcherInfo)).m_useConvexConservativeDistanceUtil as *const _
                as usize
        },
        56usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_useConvexConservativeDistanceUtil)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btDispatcherInfo)).m_convexConservativeDistanceThreshold as *const _
                as usize
        },
        64usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDispatcherInfo),
            "::",
            stringify!(m_convexConservativeDistanceThreshold)
        )
    );
}
pub const ebtDispatcherQueryType_BT_CONTACT_POINT_ALGORITHMS: ebtDispatcherQueryType = 1;
pub const ebtDispatcherQueryType_BT_CLOSEST_POINT_ALGORITHMS: ebtDispatcherQueryType = 2;
pub type ebtDispatcherQueryType = ::std::os::raw::c_uint;
#[repr(C)]
pub struct btDispatcher__bindgen_vtable(::std::os::raw::c_void);
/// The btDispatcher interface class can be used in combination with broadphase to dispatch calculations for overlapping pairs.
/// For example for pairwise collision detection, calculating contact points stored in btPersistentManifold or user callbacks (game logic).
#[repr(C)]
#[derive(Debug)]
pub struct btDispatcher {
    pub vtable_: *const btDispatcher__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_btDispatcher() {
    assert_eq!(
        ::std::mem::size_of::<btDispatcher>(),
        8usize,
        concat!("Size of: ", stringify!(btDispatcher))
    );
    assert_eq!(
        ::std::mem::align_of::<btDispatcher>(),
        8usize,
        concat!("Alignment of ", stringify!(btDispatcher))
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcherD0Ev"]
    pub fn btDispatcher_btDispatcher_destructor(this: *mut btDispatcher);
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher13findAlgorithmEPK24btCollisionObjectWrapperS2_P20btPersistentManifold22ebtDispatcherQueryType"]
    pub fn btDispatcher_findAlgorithm(
        this: *mut ::std::os::raw::c_void,
        body0Wrap: *const btCollisionObjectWrapper,
        body1Wrap: *const btCollisionObjectWrapper,
        sharedManifold: *mut btPersistentManifold,
        queryType: ebtDispatcherQueryType,
    ) -> *mut btCollisionAlgorithm;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher14getNewManifoldEPK17btCollisionObjectS2_"]
    pub fn btDispatcher_getNewManifold(
        this: *mut ::std::os::raw::c_void,
        b0: *const btCollisionObject,
        b1: *const btCollisionObject,
    ) -> *mut btPersistentManifold;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher15releaseManifoldEP20btPersistentManifold"]
    pub fn btDispatcher_releaseManifold(
        this: *mut ::std::os::raw::c_void,
        manifold: *mut btPersistentManifold,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher13clearManifoldEP20btPersistentManifold"]
    pub fn btDispatcher_clearManifold(
        this: *mut ::std::os::raw::c_void,
        manifold: *mut btPersistentManifold,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher14needsCollisionEPK17btCollisionObjectS2_"]
    pub fn btDispatcher_needsCollision(
        this: *mut ::std::os::raw::c_void,
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher13needsResponseEPK17btCollisionObjectS2_"]
    pub fn btDispatcher_needsResponse(
        this: *mut ::std::os::raw::c_void,
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher25dispatchAllCollisionPairsEP22btOverlappingPairCacheRK16btDispatcherInfoPS_"]
    pub fn btDispatcher_dispatchAllCollisionPairs(
        this: *mut ::std::os::raw::c_void,
        pairCache: *mut btOverlappingPairCache,
        dispatchInfo: *const btDispatcherInfo,
        dispatcher: *mut btDispatcher,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZNK12btDispatcher15getNumManifoldsEv"]
    pub fn btDispatcher_getNumManifolds(this: *mut ::std::os::raw::c_void)
        -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher26getManifoldByIndexInternalEi"]
    pub fn btDispatcher_getManifoldByIndexInternal(
        this: *mut ::std::os::raw::c_void,
        index: ::std::os::raw::c_int,
    ) -> *mut btPersistentManifold;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher26getInternalManifoldPointerEv"]
    pub fn btDispatcher_getInternalManifoldPointer(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut *mut btPersistentManifold;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher23getInternalManifoldPoolEv"]
    pub fn btDispatcher_getInternalManifoldPool(
        this: *mut ::std::os::raw::c_void,
    ) -> *mut btPoolAllocator;
}
extern "C" {
    #[link_name = "\u{1}_ZNK12btDispatcher23getInternalManifoldPoolEv"]
    pub fn btDispatcher_getInternalManifoldPool1(
        this: *mut ::std::os::raw::c_void,
    ) -> *const btPoolAllocator;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher26allocateCollisionAlgorithmEi"]
    pub fn btDispatcher_allocateCollisionAlgorithm(
        this: *mut ::std::os::raw::c_void,
        size: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    #[link_name = "\u{1}_ZN12btDispatcher22freeCollisionAlgorithmEPv"]
    pub fn btDispatcher_freeCollisionAlgorithm(
        this: *mut ::std::os::raw::c_void,
        ptr: *mut ::std::os::raw::c_void,
    );
}
/// Utils related to temporal transforms
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btTransformUtil {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_btTransformUtil() {
    assert_eq!(
        ::std::mem::size_of::<btTransformUtil>(),
        1usize,
        concat!("Size of: ", stringify!(btTransformUtil))
    );
    assert_eq!(
        ::std::mem::align_of::<btTransformUtil>(),
        1usize,
        concat!("Alignment of ", stringify!(btTransformUtil))
    );
}
/// The btConvexSeparatingDistanceUtil can help speed up convex collision detection
/// by conservatively updating a cached separating distance/vector instead of re-calculating the closest distance
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btConvexSeparatingDistanceUtil {
    pub m_ornA: btQuaternion,
    pub m_ornB: btQuaternion,
    pub m_posA: btVector3,
    pub m_posB: btVector3,
    pub m_separatingNormal: btVector3,
    pub m_boundingRadiusA: btScalar,
    pub m_boundingRadiusB: btScalar,
    pub m_separatingDistance: btScalar,
}
#[test]
fn bindgen_test_layout_btConvexSeparatingDistanceUtil() {
    assert_eq!(
        ::std::mem::size_of::<btConvexSeparatingDistanceUtil>(),
        184usize,
        concat!("Size of: ", stringify!(btConvexSeparatingDistanceUtil))
    );
    assert_eq!(
        ::std::mem::align_of::<btConvexSeparatingDistanceUtil>(),
        8usize,
        concat!("Alignment of ", stringify!(btConvexSeparatingDistanceUtil))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConvexSeparatingDistanceUtil)).m_ornA as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_ornA)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConvexSeparatingDistanceUtil)).m_ornB as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_ornB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConvexSeparatingDistanceUtil)).m_posA as *const _ as usize },
        64usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_posA)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConvexSeparatingDistanceUtil)).m_posB as *const _ as usize },
        96usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_posB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btConvexSeparatingDistanceUtil)).m_separatingNormal as *const _ as usize
        },
        128usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_separatingNormal)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btConvexSeparatingDistanceUtil)).m_boundingRadiusA as *const _ as usize
        },
        160usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_boundingRadiusA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btConvexSeparatingDistanceUtil)).m_boundingRadiusB as *const _ as usize
        },
        168usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_boundingRadiusB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btConvexSeparatingDistanceUtil)).m_separatingDistance as *const _
                as usize
        },
        176usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConvexSeparatingDistanceUtil),
            "::",
            stringify!(m_separatingDistance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btConstraintRow {
    pub m_normal: [btScalar; 3usize],
    pub m_rhs: btScalar,
    pub m_jacDiagInv: btScalar,
    pub m_lowerLimit: btScalar,
    pub m_upperLimit: btScalar,
    pub m_accumImpulse: btScalar,
}
#[test]
fn bindgen_test_layout_btConstraintRow() {
    assert_eq!(
        ::std::mem::size_of::<btConstraintRow>(),
        64usize,
        concat!("Size of: ", stringify!(btConstraintRow))
    );
    assert_eq!(
        ::std::mem::align_of::<btConstraintRow>(),
        8usize,
        concat!("Alignment of ", stringify!(btConstraintRow))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConstraintRow)).m_normal as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConstraintRow),
            "::",
            stringify!(m_normal)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConstraintRow)).m_rhs as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConstraintRow),
            "::",
            stringify!(m_rhs)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConstraintRow)).m_jacDiagInv as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConstraintRow),
            "::",
            stringify!(m_jacDiagInv)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConstraintRow)).m_lowerLimit as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConstraintRow),
            "::",
            stringify!(m_lowerLimit)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConstraintRow)).m_upperLimit as *const _ as usize },
        48usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConstraintRow),
            "::",
            stringify!(m_upperLimit)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btConstraintRow)).m_accumImpulse as *const _ as usize },
        56usize,
        concat!(
            "Alignment of field: ",
            stringify!(btConstraintRow),
            "::",
            stringify!(m_accumImpulse)
        )
    );
}
pub type PfxConstraintRow = btConstraintRow;
pub const btContactPointFlags_BT_CONTACT_FLAG_LATERAL_FRICTION_INITIALIZED: btContactPointFlags = 1;
pub const btContactPointFlags_BT_CONTACT_FLAG_HAS_CONTACT_CFM: btContactPointFlags = 2;
pub const btContactPointFlags_BT_CONTACT_FLAG_HAS_CONTACT_ERP: btContactPointFlags = 4;
pub const btContactPointFlags_BT_CONTACT_FLAG_CONTACT_STIFFNESS_DAMPING: btContactPointFlags = 8;
pub const btContactPointFlags_BT_CONTACT_FLAG_FRICTION_ANCHOR: btContactPointFlags = 16;
pub type btContactPointFlags = ::std::os::raw::c_uint;
/// ManifoldContactPoint collects and maintains persistent contactpoints.
/// used to improve stability and performance of rigidbody dynamics response.
#[repr(C)]
#[derive(Copy, Clone)]
pub struct btManifoldPoint {
    pub m_localPointA: btVector3,
    pub m_localPointB: btVector3,
    pub m_positionWorldOnB: btVector3,
    /// m_positionWorldOnA is redundant information, see getPositionWorldOnA(), but for clarity
    pub m_positionWorldOnA: btVector3,
    pub m_normalWorldOnB: btVector3,
    pub m_distance1: btScalar,
    pub m_combinedFriction: btScalar,
    pub m_combinedRollingFriction: btScalar,
    pub m_combinedSpinningFriction: btScalar,
    pub m_combinedRestitution: btScalar,
    pub m_partId0: ::std::os::raw::c_int,
    pub m_partId1: ::std::os::raw::c_int,
    pub m_index0: ::std::os::raw::c_int,
    pub m_index1: ::std::os::raw::c_int,
    pub m_userPersistentData: *mut ::std::os::raw::c_void,
    pub m_contactPointFlags: ::std::os::raw::c_int,
    pub m_appliedImpulse: btScalar,
    pub m_appliedImpulseLateral1: btScalar,
    pub m_appliedImpulseLateral2: btScalar,
    pub m_contactMotion1: btScalar,
    pub m_contactMotion2: btScalar,
    pub __bindgen_anon_1: btManifoldPoint__bindgen_ty_1,
    pub __bindgen_anon_2: btManifoldPoint__bindgen_ty_2,
    pub m_frictionCFM: btScalar,
    pub m_lifeTime: ::std::os::raw::c_int,
    pub m_lateralFrictionDir1: btVector3,
    pub m_lateralFrictionDir2: btVector3,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union btManifoldPoint__bindgen_ty_1 {
    pub m_contactCFM: btScalar,
    pub m_combinedContactStiffness1: btScalar,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_btManifoldPoint__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<btManifoldPoint__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(btManifoldPoint__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<btManifoldPoint__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(btManifoldPoint__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btManifoldPoint__bindgen_ty_1)).m_contactCFM as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint__bindgen_ty_1),
            "::",
            stringify!(m_contactCFM)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btManifoldPoint__bindgen_ty_1)).m_combinedContactStiffness1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint__bindgen_ty_1),
            "::",
            stringify!(m_combinedContactStiffness1)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union btManifoldPoint__bindgen_ty_2 {
    pub m_contactERP: btScalar,
    pub m_combinedContactDamping1: btScalar,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_btManifoldPoint__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<btManifoldPoint__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(btManifoldPoint__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<btManifoldPoint__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(btManifoldPoint__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btManifoldPoint__bindgen_ty_2)).m_contactERP as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint__bindgen_ty_2),
            "::",
            stringify!(m_contactERP)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btManifoldPoint__bindgen_ty_2)).m_combinedContactDamping1 as *const _
                as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint__bindgen_ty_2),
            "::",
            stringify!(m_combinedContactDamping1)
        )
    );
}
#[test]
fn bindgen_test_layout_btManifoldPoint() {
    assert_eq!(
        ::std::mem::size_of::<btManifoldPoint>(),
        368usize,
        concat!("Size of: ", stringify!(btManifoldPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<btManifoldPoint>(),
        8usize,
        concat!("Alignment of ", stringify!(btManifoldPoint))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_localPointA as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_localPointA)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_localPointB as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_localPointB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_positionWorldOnB as *const _ as usize },
        64usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_positionWorldOnB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_positionWorldOnA as *const _ as usize },
        96usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_positionWorldOnA)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_normalWorldOnB as *const _ as usize },
        128usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_normalWorldOnB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_distance1 as *const _ as usize },
        160usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_distance1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_combinedFriction as *const _ as usize },
        168usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_combinedFriction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_combinedRollingFriction as *const _ as usize },
        176usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_combinedRollingFriction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btManifoldPoint)).m_combinedSpinningFriction as *const _ as usize
        },
        184usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_combinedSpinningFriction)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_combinedRestitution as *const _ as usize },
        192usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_combinedRestitution)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_partId0 as *const _ as usize },
        200usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_partId0)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_partId1 as *const _ as usize },
        204usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_partId1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_index0 as *const _ as usize },
        208usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_index0)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_index1 as *const _ as usize },
        212usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_index1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_userPersistentData as *const _ as usize },
        216usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_userPersistentData)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_contactPointFlags as *const _ as usize },
        224usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_contactPointFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_appliedImpulse as *const _ as usize },
        232usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_appliedImpulse)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_appliedImpulseLateral1 as *const _ as usize },
        240usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_appliedImpulseLateral1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_appliedImpulseLateral2 as *const _ as usize },
        248usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_appliedImpulseLateral2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_contactMotion1 as *const _ as usize },
        256usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_contactMotion1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_contactMotion2 as *const _ as usize },
        264usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_contactMotion2)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_frictionCFM as *const _ as usize },
        288usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_frictionCFM)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_lifeTime as *const _ as usize },
        296usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_lifeTime)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_lateralFrictionDir1 as *const _ as usize },
        304usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_lateralFrictionDir1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldPoint)).m_lateralFrictionDir2 as *const _ as usize },
        336usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldPoint),
            "::",
            stringify!(m_lateralFrictionDir2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btCollisionResult {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "\u{1}gContactBreakingThreshold"]
    pub static mut gContactBreakingThreshold: btScalar;
}
pub type ContactDestroyedCallback = ::std::option::Option<
    unsafe extern "C" fn(userPersistentData: *mut ::std::os::raw::c_void) -> bool,
>;
pub type ContactProcessedCallback = ::std::option::Option<
    unsafe extern "C" fn(
        cp: *mut btManifoldPoint,
        body0: *mut ::std::os::raw::c_void,
        body1: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
pub type ContactStartedCallback = ::std::option::Option<
    unsafe extern "C" fn(manifold: *const *const btPersistentManifold),
>;
pub type ContactEndedCallback = ::std::option::Option<
    unsafe extern "C" fn(manifold: *const *const btPersistentManifold),
>;
extern "C" {
    #[link_name = "\u{1}gContactDestroyedCallback"]
    pub static mut gContactDestroyedCallback: ContactDestroyedCallback;
}
extern "C" {
    #[link_name = "\u{1}gContactProcessedCallback"]
    pub static mut gContactProcessedCallback: ContactProcessedCallback;
}
extern "C" {
    #[link_name = "\u{1}gContactStartedCallback"]
    pub static mut gContactStartedCallback: ContactStartedCallback;
}
extern "C" {
    #[link_name = "\u{1}gContactEndedCallback"]
    pub static mut gContactEndedCallback: ContactEndedCallback;
}
pub const btContactManifoldTypes_MIN_CONTACT_MANIFOLD_TYPE: btContactManifoldTypes = 1024;
pub const btContactManifoldTypes_BT_PERSISTENT_MANIFOLD_TYPE: btContactManifoldTypes = 1025;
pub type btContactManifoldTypes = ::std::os::raw::c_uint;
/// btPersistentManifold is a contact point cache, it stays persistent as long as objects are overlapping in the broadphase.
/// Those contact points are created by the collision narrow phase.
/// The cache can be empty, or hold 1,2,3 or 4 points. Some collision algorithms (GJK) might only add one point at a time.
/// updates/refreshes old contact points, and throw them away if necessary (distance becomes too large)
/// reduces the cache to 4 points, when more then 4 points are added, using following rules:
/// the contact point with deepest penetration is always kept, and it tries to maximuze the area covered by the points
/// note that some pairs of objects might have more then one contact manifold.
#[repr(C)]
#[derive(Copy, Clone)]
pub struct btPersistentManifold {
    pub _base: btTypedObject,
    pub m_pointCache: [btManifoldPoint; 4usize],
    /// this two body pointers can point to the physics rigidbody class.
    pub m_body0: *const btCollisionObject,
    pub m_body1: *const btCollisionObject,
    pub m_cachedPoints: ::std::os::raw::c_int,
    pub m_contactBreakingThreshold: btScalar,
    pub m_contactProcessingThreshold: btScalar,
    pub m_companionIdA: ::std::os::raw::c_int,
    pub m_companionIdB: ::std::os::raw::c_int,
    pub m_index1a: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_btPersistentManifold() {
    assert_eq!(
        ::std::mem::size_of::<btPersistentManifold>(),
        1536usize,
        concat!("Size of: ", stringify!(btPersistentManifold))
    );
    assert_eq!(
        ::std::mem::align_of::<btPersistentManifold>(),
        8usize,
        concat!("Alignment of ", stringify!(btPersistentManifold))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_pointCache as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_pointCache)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_body0 as *const _ as usize },
        1480usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_body0)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_body1 as *const _ as usize },
        1488usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_body1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_cachedPoints as *const _ as usize },
        1496usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_cachedPoints)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btPersistentManifold)).m_contactBreakingThreshold as *const _ as usize
        },
        1504usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_contactBreakingThreshold)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btPersistentManifold)).m_contactProcessingThreshold as *const _ as usize
        },
        1512usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_contactProcessingThreshold)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_companionIdA as *const _ as usize },
        1520usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_companionIdA)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_companionIdB as *const _ as usize },
        1524usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_companionIdB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btPersistentManifold)).m_index1a as *const _ as usize },
        1528usize,
        concat!(
            "Alignment of field: ",
            stringify!(btPersistentManifold),
            "::",
            stringify!(m_index1a)
        )
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN20btPersistentManifold14clearUserCacheER15btManifoldPoint"]
    pub fn btPersistentManifold_clearUserCache(
        this: *mut btPersistentManifold,
        pt: *mut btManifoldPoint,
    );
}
extern "C" {

    /// @todo: get this margin from the current physics / collision environment

    #[link_name = "\u{1}_ZNK20btPersistentManifold27getContactBreakingThresholdEv"]
    pub fn btPersistentManifold_getContactBreakingThreshold(
        this: *const btPersistentManifold,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZNK20btPersistentManifold13getCacheEntryERK15btManifoldPoint"]
    pub fn btPersistentManifold_getCacheEntry(
        this: *const btPersistentManifold,
        newPoint: *const btManifoldPoint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}_ZN20btPersistentManifold16addManifoldPointERK15btManifoldPointb"]
    pub fn btPersistentManifold_addManifoldPoint(
        this: *mut btPersistentManifold,
        newPoint: *const btManifoldPoint,
        isPredictive: bool,
    ) -> ::std::os::raw::c_int;
}
extern "C" {

    /// calculated new worldspace coordinates and depth, and reject points that exceed the collision margin

    #[link_name = "\u{1}_ZN20btPersistentManifold20refreshContactPointsERK11btTransformS2_"]
    pub fn btPersistentManifold_refreshContactPoints(
        this: *mut btPersistentManifold,
        trA: *const btTransform,
        trB: *const btTransform,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN20btPersistentManifoldC1Ev"]
    pub fn btPersistentManifold_btPersistentManifold(this: *mut btPersistentManifold);
}
impl btPersistentManifold {
    #[inline]
    pub unsafe fn clearUserCache(&mut self, pt: *mut btManifoldPoint) {
        btPersistentManifold_clearUserCache(self, pt)
    }
    #[inline]
    pub unsafe fn getContactBreakingThreshold(&self) -> btScalar {
        btPersistentManifold_getContactBreakingThreshold(self)
    }
    #[inline]
    pub unsafe fn getCacheEntry(&self, newPoint: *const btManifoldPoint) -> ::std::os::raw::c_int {
        btPersistentManifold_getCacheEntry(self, newPoint)
    }
    #[inline]
    pub unsafe fn addManifoldPoint(
        &mut self,
        newPoint: *const btManifoldPoint,
        isPredictive: bool,
    ) -> ::std::os::raw::c_int {
        btPersistentManifold_addManifoldPoint(self, newPoint, isPredictive)
    }
    #[inline]
    pub unsafe fn refreshContactPoints(
        &mut self,
        trA: *const btTransform,
        trB: *const btTransform,
    ) {
        btPersistentManifold_refreshContactPoints(self, trA, trB)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        btPersistentManifold_btPersistentManifold(&mut __bindgen_tmp);
        __bindgen_tmp
    }
}
#[repr(C)]
pub struct btDiscreteCollisionDetectorInterface__bindgen_vtable(::std::os::raw::c_void);
/// This interface is made to be used by an iterative approach to do TimeOfImpact calculations
/// This interface allows to query for closest points and penetration depth between two (convex) objects
/// the closest point is on the second object (B), and the normal points from the surface on B towards A.
/// distance is between closest points on B and closest point on A. So you can calculate closest point on A
/// by taking closestPointInA = closestPointInB + m_distance * m_normalOnSurfaceB
#[repr(C)]
#[derive(Debug)]
pub struct btDiscreteCollisionDetectorInterface {
    pub vtable_: *const btDiscreteCollisionDetectorInterface__bindgen_vtable,
}
#[repr(C)]
pub struct btDiscreteCollisionDetectorInterface_Result__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct btDiscreteCollisionDetectorInterface_Result {
    pub vtable_: *const btDiscreteCollisionDetectorInterface_Result__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_btDiscreteCollisionDetectorInterface_Result() {
    assert_eq!(
        ::std::mem::size_of::<btDiscreteCollisionDetectorInterface_Result>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(btDiscreteCollisionDetectorInterface_Result)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<btDiscreteCollisionDetectorInterface_Result>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(btDiscreteCollisionDetectorInterface_Result)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btDiscreteCollisionDetectorInterface_ClosestPointInput {
    pub m_transformA: btTransform,
    pub m_transformB: btTransform,
    pub m_maximumDistanceSquared: btScalar,
}
#[test]
fn bindgen_test_layout_btDiscreteCollisionDetectorInterface_ClosestPointInput() {
    assert_eq!(
        ::std::mem::size_of::<btDiscreteCollisionDetectorInterface_ClosestPointInput>(),
        264usize,
        concat!(
            "Size of: ",
            stringify!(btDiscreteCollisionDetectorInterface_ClosestPointInput)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<btDiscreteCollisionDetectorInterface_ClosestPointInput>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(btDiscreteCollisionDetectorInterface_ClosestPointInput)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btDiscreteCollisionDetectorInterface_ClosestPointInput)).m_transformA
                as *const _ as usize
        },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDiscreteCollisionDetectorInterface_ClosestPointInput),
            "::",
            stringify!(m_transformA)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btDiscreteCollisionDetectorInterface_ClosestPointInput)).m_transformB
                as *const _ as usize
        },
        128usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDiscreteCollisionDetectorInterface_ClosestPointInput),
            "::",
            stringify!(m_transformB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btDiscreteCollisionDetectorInterface_ClosestPointInput))
                .m_maximumDistanceSquared as *const _ as usize
        },
        256usize,
        concat!(
            "Alignment of field: ",
            stringify!(btDiscreteCollisionDetectorInterface_ClosestPointInput),
            "::",
            stringify!(m_maximumDistanceSquared)
        )
    );
}
#[test]
fn bindgen_test_layout_btDiscreteCollisionDetectorInterface() {
    assert_eq!(
        ::std::mem::size_of::<btDiscreteCollisionDetectorInterface>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(btDiscreteCollisionDetectorInterface)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<btDiscreteCollisionDetectorInterface>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(btDiscreteCollisionDetectorInterface)
        )
    );
}
extern "C" {

    /// setShapeIdentifiersA/B provides experimental support for per-triangle material / custom material combiner

    #[link_name = "\u{1}_ZN36btDiscreteCollisionDetectorInterface6Result20setShapeIdentifiersAEii"]
    pub fn btDiscreteCollisionDetectorInterface_Result_setShapeIdentifiersA(
        this: *mut ::std::os::raw::c_void,
        partId0: ::std::os::raw::c_int,
        index0: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN36btDiscreteCollisionDetectorInterface6Result20setShapeIdentifiersBEii"]
    pub fn btDiscreteCollisionDetectorInterface_Result_setShapeIdentifiersB(
        this: *mut ::std::os::raw::c_void,
        partId1: ::std::os::raw::c_int,
        index1: ::std::os::raw::c_int,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN36btDiscreteCollisionDetectorInterface6Result15addContactPointERK9btVector3S3_d"]
    pub fn btDiscreteCollisionDetectorInterface_Result_addContactPoint(
        this: *mut ::std::os::raw::c_void,
        normalOnBInWorld: *const btVector3,
        pointInWorld: *const btVector3,
        depth: btScalar,
    );
}
extern "C" {
    #[link_name = "\u{1}_ZN36btDiscreteCollisionDetectorInterface16getClosestPointsERKNS_17ClosestPointInputERNS_6ResultEP12btIDebugDrawb"]
    pub fn btDiscreteCollisionDetectorInterface_getClosestPoints(
        this: *mut ::std::os::raw::c_void,
        input: *const btDiscreteCollisionDetectorInterface_ClosestPointInput,
        output: *mut btDiscreteCollisionDetectorInterface_Result,
        debugDraw: *mut btIDebugDraw,
        swapResults: bool,
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct btStorageResult {
    pub _base: btDiscreteCollisionDetectorInterface_Result,
    pub m_normalOnSurfaceB: btVector3,
    pub m_closestPointInB: btVector3,
    pub m_distance: btScalar,
}
#[test]
fn bindgen_test_layout_btStorageResult() {
    assert_eq!(
        ::std::mem::size_of::<btStorageResult>(),
        80usize,
        concat!("Size of: ", stringify!(btStorageResult))
    );
    assert_eq!(
        ::std::mem::align_of::<btStorageResult>(),
        8usize,
        concat!("Alignment of ", stringify!(btStorageResult))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btStorageResult)).m_normalOnSurfaceB as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btStorageResult),
            "::",
            stringify!(m_normalOnSurfaceB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btStorageResult)).m_closestPointInB as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(btStorageResult),
            "::",
            stringify!(m_closestPointInB)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btStorageResult)).m_distance as *const _ as usize },
        72usize,
        concat!(
            "Alignment of field: ",
            stringify!(btStorageResult),
            "::",
            stringify!(m_distance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btCollisionObjectWrapper {
    pub m_parent: *const btCollisionObjectWrapper,
    pub m_shape: *const btCollisionShape,
    pub m_collisionObject: *const btCollisionObject,
    pub m_worldTransform: *const btTransform,
    pub m_partId: ::std::os::raw::c_int,
    pub m_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_btCollisionObjectWrapper() {
    assert_eq!(
        ::std::mem::size_of::<btCollisionObjectWrapper>(),
        40usize,
        concat!("Size of: ", stringify!(btCollisionObjectWrapper))
    );
    assert_eq!(
        ::std::mem::align_of::<btCollisionObjectWrapper>(),
        8usize,
        concat!("Alignment of ", stringify!(btCollisionObjectWrapper))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectWrapper)).m_parent as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectWrapper),
            "::",
            stringify!(m_parent)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectWrapper)).m_shape as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectWrapper),
            "::",
            stringify!(m_shape)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btCollisionObjectWrapper)).m_collisionObject as *const _ as usize
        },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectWrapper),
            "::",
            stringify!(m_collisionObject)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectWrapper)).m_worldTransform as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectWrapper),
            "::",
            stringify!(m_worldTransform)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectWrapper)).m_partId as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectWrapper),
            "::",
            stringify!(m_partId)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btCollisionObjectWrapper)).m_index as *const _ as usize },
        36usize,
        concat!(
            "Alignment of field: ",
            stringify!(btCollisionObjectWrapper),
            "::",
            stringify!(m_index)
        )
    );
}
pub type ContactAddedCallback = ::std::option::Option<
    unsafe extern "C" fn(
        cp: *mut btManifoldPoint,
        colObj0Wrap: *const btCollisionObjectWrapper,
        partId0: ::std::os::raw::c_int,
        index0: ::std::os::raw::c_int,
        colObj1Wrap: *const btCollisionObjectWrapper,
        partId1: ::std::os::raw::c_int,
        index1: ::std::os::raw::c_int,
    ) -> bool,
>;
extern "C" {
    #[link_name = "\u{1}gContactAddedCallback"]
    pub static mut gContactAddedCallback: ContactAddedCallback;
}
/// btManifoldResult is a helper class to manage  contact results.
#[repr(C)]
#[derive(Debug)]
pub struct btManifoldResult {
    pub _base: btDiscreteCollisionDetectorInterface_Result,
    pub m_manifoldPtr: *mut btPersistentManifold,
    pub m_body0Wrap: *const btCollisionObjectWrapper,
    pub m_body1Wrap: *const btCollisionObjectWrapper,
    pub m_partId0: ::std::os::raw::c_int,
    pub m_partId1: ::std::os::raw::c_int,
    pub m_index0: ::std::os::raw::c_int,
    pub m_index1: ::std::os::raw::c_int,
    pub m_closestPointDistanceThreshold: btScalar,
}
#[test]
fn bindgen_test_layout_btManifoldResult() {
    assert_eq!(
        ::std::mem::size_of::<btManifoldResult>(),
        56usize,
        concat!("Size of: ", stringify!(btManifoldResult))
    );
    assert_eq!(
        ::std::mem::align_of::<btManifoldResult>(),
        8usize,
        concat!("Alignment of ", stringify!(btManifoldResult))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_manifoldPtr as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_manifoldPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_body0Wrap as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_body0Wrap)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_body1Wrap as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_body1Wrap)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_partId0 as *const _ as usize },
        32usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_partId0)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_partId1 as *const _ as usize },
        36usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_partId1)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_index0 as *const _ as usize },
        40usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_index0)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btManifoldResult)).m_index1 as *const _ as usize },
        44usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_index1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(0 as *const btManifoldResult)).m_closestPointDistanceThreshold as *const _ as usize
        },
        48usize,
        concat!(
            "Alignment of field: ",
            stringify!(btManifoldResult),
            "::",
            stringify!(m_closestPointDistanceThreshold)
        )
    );
}
extern "C" {

    /// in the future we can let the user override the methods to combine restitution and friction

    #[link_name = "\u{1}_ZN16btManifoldResult28calculateCombinedRestitutionEPK17btCollisionObjectS2_"]
    pub fn btManifoldResult_calculateCombinedRestitution(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResult25calculateCombinedFrictionEPK17btCollisionObjectS2_"]
    pub fn btManifoldResult_calculateCombinedFriction(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResult32calculateCombinedRollingFrictionEPK17btCollisionObjectS2_"]
    pub fn btManifoldResult_calculateCombinedRollingFriction(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResult33calculateCombinedSpinningFrictionEPK17btCollisionObjectS2_"]
    pub fn btManifoldResult_calculateCombinedSpinningFriction(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResult31calculateCombinedContactDampingEPK17btCollisionObjectS2_"]
    pub fn btManifoldResult_calculateCombinedContactDamping(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResult33calculateCombinedContactStiffnessEPK17btCollisionObjectS2_"]
    pub fn btManifoldResult_calculateCombinedContactStiffness(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar;
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResultC1EPK24btCollisionObjectWrapperS2_"]
    pub fn btManifoldResult_btManifoldResult(
        this: *mut btManifoldResult,
        body0Wrap: *const btCollisionObjectWrapper,
        body1Wrap: *const btCollisionObjectWrapper,
    );
}
impl btManifoldResult {
    #[inline]
    pub unsafe fn calculateCombinedRestitution(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar {
        btManifoldResult_calculateCombinedRestitution(body0, body1)
    }
    #[inline]
    pub unsafe fn calculateCombinedFriction(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar {
        btManifoldResult_calculateCombinedFriction(body0, body1)
    }
    #[inline]
    pub unsafe fn calculateCombinedRollingFriction(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar {
        btManifoldResult_calculateCombinedRollingFriction(body0, body1)
    }
    #[inline]
    pub unsafe fn calculateCombinedSpinningFriction(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar {
        btManifoldResult_calculateCombinedSpinningFriction(body0, body1)
    }
    #[inline]
    pub unsafe fn calculateCombinedContactDamping(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar {
        btManifoldResult_calculateCombinedContactDamping(body0, body1)
    }
    #[inline]
    pub unsafe fn calculateCombinedContactStiffness(
        body0: *const btCollisionObject,
        body1: *const btCollisionObject,
    ) -> btScalar {
        btManifoldResult_calculateCombinedContactStiffness(body0, body1)
    }
    #[inline]
    pub unsafe fn new(
        body0Wrap: *const btCollisionObjectWrapper,
        body1Wrap: *const btCollisionObjectWrapper,
    ) -> Self {
        let mut __bindgen_tmp = ::std::mem::uninitialized();
        btManifoldResult_btManifoldResult(&mut __bindgen_tmp, body0Wrap, body1Wrap);
        __bindgen_tmp
    }
}
extern "C" {
    #[link_name = "\u{1}_ZN16btManifoldResult15addContactPointERK9btVector3S2_d"]
    pub fn btManifoldResult_addContactPoint(
        this: *mut ::std::os::raw::c_void,
        normalOnBInWorld: *const btVector3,
        pointInWorld: *const btVector3,
        depth: btScalar,
    );
}
pub const BroadphaseNativeTypes_BOX_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 0;
pub const BroadphaseNativeTypes_TRIANGLE_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 1;
pub const BroadphaseNativeTypes_TETRAHEDRAL_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 2;
pub const BroadphaseNativeTypes_CONVEX_TRIANGLEMESH_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 3;
pub const BroadphaseNativeTypes_CONVEX_HULL_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 4;
pub const BroadphaseNativeTypes_CONVEX_POINT_CLOUD_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 5;
pub const BroadphaseNativeTypes_CUSTOM_POLYHEDRAL_SHAPE_TYPE: BroadphaseNativeTypes = 6;
pub const BroadphaseNativeTypes_IMPLICIT_CONVEX_SHAPES_START_HERE: BroadphaseNativeTypes = 7;
pub const BroadphaseNativeTypes_SPHERE_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 8;
pub const BroadphaseNativeTypes_MULTI_SPHERE_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 9;
pub const BroadphaseNativeTypes_CAPSULE_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 10;
pub const BroadphaseNativeTypes_CONE_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 11;
pub const BroadphaseNativeTypes_CONVEX_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 12;
pub const BroadphaseNativeTypes_CYLINDER_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 13;
pub const BroadphaseNativeTypes_UNIFORM_SCALING_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 14;
pub const BroadphaseNativeTypes_MINKOWSKI_SUM_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 15;
pub const BroadphaseNativeTypes_MINKOWSKI_DIFFERENCE_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 16;
pub const BroadphaseNativeTypes_BOX_2D_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 17;
pub const BroadphaseNativeTypes_CONVEX_2D_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 18;
pub const BroadphaseNativeTypes_CUSTOM_CONVEX_SHAPE_TYPE: BroadphaseNativeTypes = 19;
pub const BroadphaseNativeTypes_CONCAVE_SHAPES_START_HERE: BroadphaseNativeTypes = 20;
pub const BroadphaseNativeTypes_TRIANGLE_MESH_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 21;
pub const BroadphaseNativeTypes_SCALED_TRIANGLE_MESH_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 22;
pub const BroadphaseNativeTypes_FAST_CONCAVE_MESH_PROXYTYPE: BroadphaseNativeTypes = 23;
pub const BroadphaseNativeTypes_TERRAIN_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 24;
pub const BroadphaseNativeTypes_GIMPACT_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 25;
pub const BroadphaseNativeTypes_MULTIMATERIAL_TRIANGLE_MESH_PROXYTYPE: BroadphaseNativeTypes = 26;
pub const BroadphaseNativeTypes_EMPTY_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 27;
pub const BroadphaseNativeTypes_STATIC_PLANE_PROXYTYPE: BroadphaseNativeTypes = 28;
pub const BroadphaseNativeTypes_CUSTOM_CONCAVE_SHAPE_TYPE: BroadphaseNativeTypes = 29;
pub const BroadphaseNativeTypes_CONCAVE_SHAPES_END_HERE: BroadphaseNativeTypes = 30;
pub const BroadphaseNativeTypes_COMPOUND_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 31;
pub const BroadphaseNativeTypes_SOFTBODY_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 32;
pub const BroadphaseNativeTypes_HFFLUID_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 33;
pub const BroadphaseNativeTypes_HFFLUID_BUOYANT_CONVEX_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 34;
pub const BroadphaseNativeTypes_INVALID_SHAPE_PROXYTYPE: BroadphaseNativeTypes = 35;
pub const BroadphaseNativeTypes_MAX_BROADPHASE_COLLISION_TYPES: BroadphaseNativeTypes = 36;
pub type BroadphaseNativeTypes = ::std::os::raw::c_uint;
/// The btBroadphaseProxy is the main class that can be used with the Bullet broadphases.
/// It stores collision shape type information, collision filter information and a client object, typically a btCollisionObject or btRigidBody.
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct btBroadphaseProxy {
    pub m_clientObject: *mut ::std::os::raw::c_void,
    pub m_collisionFilterGroup: ::std::os::raw::c_int,
    pub m_collisionFilterMask: ::std::os::raw::c_int,
    pub m_uniqueId: ::std::os::raw::c_int,
    pub m_aabbMin: btVector3,
    pub m_aabbMax: btVector3,
}
pub const btBroadphaseProxy_CollisionFilterGroups_DefaultFilter : btBroadphaseProxy_CollisionFilterGroups = 1 ;
pub const btBroadphaseProxy_CollisionFilterGroups_StaticFilter : btBroadphaseProxy_CollisionFilterGroups = 2 ;
pub const btBroadphaseProxy_CollisionFilterGroups_KinematicFilter : btBroadphaseProxy_CollisionFilterGroups = 4 ;
pub const btBroadphaseProxy_CollisionFilterGroups_DebrisFilter : btBroadphaseProxy_CollisionFilterGroups = 8 ;
pub const btBroadphaseProxy_CollisionFilterGroups_SensorTrigger : btBroadphaseProxy_CollisionFilterGroups = 16 ;
pub const btBroadphaseProxy_CollisionFilterGroups_CharacterFilter : btBroadphaseProxy_CollisionFilterGroups = 32 ;
pub const btBroadphaseProxy_CollisionFilterGroups_AllFilter : btBroadphaseProxy_CollisionFilterGroups = -1 ;
pub type btBroadphaseProxy_CollisionFilterGroups = ::std::os::raw::c_int;
#[test]
fn bindgen_test_layout_btBroadphaseProxy() {
    assert_eq!(
        ::std::mem::size_of::<btBroadphaseProxy>(),
        88usize,
        concat!("Size of: ", stringify!(btBroadphaseProxy))
    );
    assert_eq!(
        ::std::mem::align_of::<btBroadphaseProxy>(),
        8usize,
        concat!("Alignment of ", stringify!(btBroadphaseProxy))
    );
    assert_eq!(
        unsafe { &(*(0 as *const btBroadphaseProxy)).m_clientObject as *const _ as usize },
        0usize,
        concat!(
            "Alignment of field: ",
            stringify!(btBroadphaseProxy),
            "::",
            stringify!(m_clientObject)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btBroadphaseProxy)).m_collisionFilterGroup as *const _ as usize },
        8usize,
        concat!(
            "Alignment of field: ",
            stringify!(btBroadphaseProxy),
            "::",
            stringify!(m_collisionFilterGroup)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btBroadphaseProxy)).m_collisionFilterMask as *const _ as usize },
        12usize,
        concat!(
            "Alignment of field: ",
            stringify!(btBroadphaseProxy),
            "::",
            stringify!(m_collisionFilterMask)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btBroadphaseProxy)).m_uniqueId as *const _ as usize },
        16usize,
        concat!(
            "Alignment of field: ",
            stringify!(btBroadphaseProxy),
            "::",
            stringify!(m_uniqueId)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btBroadphaseProxy)).m_aabbMin as *const _ as usize },
        24usize,
        concat!(
            "Alignment of field: ",
            stringify!(btBroadphaseProxy),
            "::",
            stringify!(m_aabbMin)
        )
    );
    assert_eq!(
        unsafe { &(*(0 as *const btBroadphaseProxy)).m_aabbMax as *const _ as usize },
        56usize,
        concat!(
            "Alignment of field: ",
            stringify!(btBroadphaseProxy),
            "::",
            stringify!(m_aabbMax)
        )
    );
}
/// The btBroadphasePair class contains a pair of aabb-overlapping objects.
/// A btDispatcher can search a btCollisionAlgorithm that performs exact/narrowphase collision detection on the actual collision shapes.
#[repr(C)]
#[derive(Copy, Clone)]
pub struct btBroadphasePair {
    pub m_pProxy0: *mut btBroadphaseProxy,
    pub m_pProxy1: *mut btBroadphaseProxy,
    pub m_algorithm: *mut btCollisionAlgorithm,
    pub __bindgen_anon_1: btBroadphasePair__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union btBroadphasePair__bindgen_ty_1 {
    pub m_internalInfo1: *mut ::std::os::raw::c_void,
    pub m_internalTmpValue: ::std::os::raw::c_int,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_btBroadphasePair__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<btBroadphasePair__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(btBroadphasePair__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<btBroadphasePair__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(btBroadphasePair__bindgen_ty_1))
