/* automatically generated by rust-bindgen */

pub const SHARED_MEMORY_KEY: ::std::os::raw::c_uint = 12347;
pub const SHARED_MEMORY_MAGIC_NUMBER: ::std::os::raw::c_uint = 201708270;
pub const MAX_VR_BUTTONS: ::std::os::raw::c_uint = 64;
pub const MAX_VR_CONTROLLERS: ::std::os::raw::c_uint = 8;
pub const MAX_RAY_INTERSECTION_BATCH_SIZE: ::std::os::raw::c_uint = 256;
pub const MAX_RAY_HITS: ::std::os::raw::c_uint = 256;
pub const MAX_KEYBOARD_EVENTS: ::std::os::raw::c_uint = 256;
pub const MAX_MOUSE_EVENTS: ::std::os::raw::c_uint = 256;
pub const VISUAL_SHAPE_MAX_PATH_LEN: ::std::os::raw::c_uint = 1024;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum EnumSharedMemoryClientCommand {
    CMD_LOAD_SDF = 0,
    CMD_LOAD_URDF = 1,
    CMD_LOAD_BULLET = 2,
    CMD_SAVE_BULLET = 3,
    CMD_LOAD_MJCF = 4,
    CMD_LOAD_BUNNY = 5,
    CMD_SEND_BULLET_DATA_STREAM = 6,
    CMD_CREATE_BOX_COLLISION_SHAPE = 7,
    CMD_CREATE_RIGID_BODY = 8,
    CMD_DELETE_RIGID_BODY = 9,
    CMD_CREATE_SENSOR = 10,
    CMD_INIT_POSE = 11,
    CMD_SEND_PHYSICS_SIMULATION_PARAMETERS = 12,
    CMD_SEND_DESIRED_STATE = 13,
    CMD_REQUEST_ACTUAL_STATE = 14,
    CMD_REQUEST_DEBUG_LINES = 15,
    CMD_REQUEST_BODY_INFO = 16,
    CMD_REQUEST_INTERNAL_DATA = 17,
    CMD_STEP_FORWARD_SIMULATION = 18,
    CMD_RESET_SIMULATION = 19,
    CMD_PICK_BODY = 20,
    CMD_MOVE_PICKED_BODY = 21,
    CMD_REMOVE_PICKING_CONSTRAINT_BODY = 22,
    CMD_REQUEST_CAMERA_IMAGE_DATA = 23,

    CMD_CREATE_VISUAL_SHAPE_FAILED = 78,
    CMD_CREATE_VISUAL_SHAPE_COMPLETED = 79,
    CMD_CREATE_MULTI_BODY_FAILED = 80,
    CMD_CREATE_MULTI_BODY_COMPLETED = 81,
    CMD_REQUEST_COLLISION_INFO_COMPLETED = 82,
    CMD_REQUEST_COLLISION_INFO_FAILED = 83,
    CMD_REQUEST_MOUSE_EVENTS_DATA_COMPLETED = 84,
    CMD_CHANGE_TEXTURE_COMMAND_FAILED = 85,
    CMD_MAX_SERVER_COMMANDS = 86,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum JointInfoFlags { JOINT_HAS_MOTORIZED_POWER = 1, }
pub const COLLISION_SHAPE_TYPE_BOX: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_BOX;
pub const COLLISION_SHAPE_TYPE_CYLINDER_X: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_CYLINDER_X;
pub const COLLISION_SHAPE_TYPE_CYLINDER_Y: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_CYLINDER_Y;
pub const COLLISION_SHAPE_TYPE_CYLINDER_Z: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_CYLINDER_Z;
pub const COLLISION_SHAPE_TYPE_CAPSULE_X: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_CAPSULE_X;
pub const COLLISION_SHAPE_TYPE_CAPSULE_Y: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_CAPSULE_Y;
pub const COLLISION_SHAPE_TYPE_CAPSULE_Z: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_CAPSULE_Z;
pub const COLLISION_SHAPE_TYPE_SPHERE: _bindgen_ty_1 =
    _bindgen_ty_1::COLLISION_SHAPE_TYPE_SPHERE;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    COLLISION_SHAPE_TYPE_BOX = 1,
    COLLISION_SHAPE_TYPE_CYLINDER_X = 2,
    COLLISION_SHAPE_TYPE_CYLINDER_Y = 3,
    COLLISION_SHAPE_TYPE_CYLINDER_Z = 4,
    COLLISION_SHAPE_TYPE_CAPSULE_X = 5,
    COLLISION_SHAPE_TYPE_CAPSULE_Y = 6,
    COLLISION_SHAPE_TYPE_CAPSULE_Z = 7,
    COLLISION_SHAPE_TYPE_SPHERE = 8,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum JointType {
    eRevoluteType = 0,
    ePrismaticType = 1,
    eSphericalType = 2,
    ePlanarType = 3,
    eFixedType = 4,
    ePoint2PointType = 5,
    eGearType = 6,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum b3JointInfoFlags {
    eJointChangeMaxForce = 1,
    eJointChangeChildFramePosition = 2,
    eJointChangeChildFrameOrientation = 4,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3JointInfo {
    pub m_linkName: *mut ::std::os::raw::c_char,
    pub m_jointName: *mut ::std::os::raw::c_char,
    pub m_jointType: ::std::os::raw::c_int,
    pub m_qIndex: ::std::os::raw::c_int,
    pub m_uIndex: ::std::os::raw::c_int,
    pub m_jointIndex: ::std::os::raw::c_int,
    pub m_flags: ::std::os::raw::c_int,
    pub m_jointDamping: f64,
    pub m_jointFriction: f64,
    pub m_jointLowerLimit: f64,
    pub m_jointUpperLimit: f64,
    pub m_jointMaxForce: f64,
    pub m_jointMaxVelocity: f64,
    pub m_parentFrame: [f64; 7usize],
    pub m_childFrame: [f64; 7usize],
    pub m_jointAxis: [f64; 3usize],
}
#[test]
fn bindgen_test_layout_b3JointInfo() {
    assert_eq!(::std::mem::size_of::<b3JointInfo>() , 224usize , concat ! (
               "Size of: " , stringify ! ( b3JointInfo ) ));
    assert_eq! (::std::mem::align_of::<b3JointInfo>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3JointInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_linkName as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_linkName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointName as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointType as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_qIndex as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_qIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_uIndex as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_uIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointIndex as * const
                _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_flags as * const _ as
                usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointDamping as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointDamping ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointFriction as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointFriction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointLowerLimit as *
                const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointLowerLimit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointUpperLimit as *
                const _ as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointUpperLimit ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointMaxForce as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointMaxForce ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointMaxVelocity as *
                const _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointMaxVelocity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_parentFrame as *
                const _ as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_parentFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_childFrame as * const
                _ as usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_childFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointInfo ) ) . m_jointAxis as * const
                _ as usize } , 200usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointInfo ) , "::" ,
                stringify ! ( m_jointAxis ) ));
}
impl Clone for b3JointInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3UserConstraint {
    pub m_parentBodyIndex: ::std::os::raw::c_int,
    pub m_parentJointIndex: ::std::os::raw::c_int,
    pub m_childBodyIndex: ::std::os::raw::c_int,
    pub m_childJointIndex: ::std::os::raw::c_int,
    pub m_parentFrame: [f64; 7usize],
    pub m_childFrame: [f64; 7usize],
    pub m_jointAxis: [f64; 3usize],
    pub m_jointType: ::std::os::raw::c_int,
    pub m_maxAppliedForce: f64,
    pub m_userConstraintUniqueId: ::std::os::raw::c_int,
    pub m_gearRatio: f64,
    pub m_gearAuxLink: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3UserConstraint() {
    assert_eq!(::std::mem::size_of::<b3UserConstraint>() , 192usize , concat !
               ( "Size of: " , stringify ! ( b3UserConstraint ) ));
    assert_eq! (::std::mem::align_of::<b3UserConstraint>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( b3UserConstraint ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_parentBodyIndex
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_parentBodyIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_parentJointIndex
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_parentJointIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_childBodyIndex
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_childBodyIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_childJointIndex
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_childJointIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_parentFrame as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_parentFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_childFrame as *
                const _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_childFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_jointAxis as *
                const _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_jointAxis ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_jointType as *
                const _ as usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_jointType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_maxAppliedForce
                as * const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_maxAppliedForce ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) .
                m_userConstraintUniqueId as * const _ as usize } , 168usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_userConstraintUniqueId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_gearRatio as *
                const _ as usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_gearRatio ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3UserConstraint ) ) . m_gearAuxLink as *
                const _ as usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( b3UserConstraint ) ,
                "::" , stringify ! ( m_gearAuxLink ) ));
}
impl Clone for b3UserConstraint {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3BodyInfo {
    pub m_baseName: *const ::std::os::raw::c_char,
    pub m_bodyName: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_b3BodyInfo() {
    assert_eq!(::std::mem::size_of::<b3BodyInfo>() , 16usize , concat ! (
               "Size of: " , stringify ! ( b3BodyInfo ) ));
    assert_eq! (::std::mem::align_of::<b3BodyInfo>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3BodyInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3BodyInfo ) ) . m_baseName as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3BodyInfo ) , "::" ,
                stringify ! ( m_baseName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3BodyInfo ) ) . m_bodyName as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3BodyInfo ) , "::" ,
                stringify ! ( m_bodyName ) ));
}
impl Clone for b3BodyInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3DynamicsInfo {
    pub m_mass: f64,
    pub m_localInertialPosition: [f64; 3usize],
    pub m_lateralFrictionCoeff: f64,
}
#[test]
fn bindgen_test_layout_b3DynamicsInfo() {
    assert_eq!(::std::mem::size_of::<b3DynamicsInfo>() , 40usize , concat ! (
               "Size of: " , stringify ! ( b3DynamicsInfo ) ));
    assert_eq! (::std::mem::align_of::<b3DynamicsInfo>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3DynamicsInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DynamicsInfo ) ) . m_mass as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3DynamicsInfo ) , "::"
                , stringify ! ( m_mass ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DynamicsInfo ) ) .
                m_localInertialPosition as * const _ as usize } , 8usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3DynamicsInfo ) , "::"
                , stringify ! ( m_localInertialPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DynamicsInfo ) ) .
                m_lateralFrictionCoeff as * const _ as usize } , 32usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3DynamicsInfo ) , "::"
                , stringify ! ( m_lateralFrictionCoeff ) ));
}
impl Clone for b3DynamicsInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum SensorType { eSensorForceTorqueType = 1, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3JointSensorState {
    pub m_jointPosition: f64,
    pub m_jointVelocity: f64,
    pub m_jointForceTorque: [f64; 6usize],
    pub m_jointMotorTorque: f64,
}
#[test]
fn bindgen_test_layout_b3JointSensorState() {
    assert_eq!(::std::mem::size_of::<b3JointSensorState>() , 72usize , concat
               ! ( "Size of: " , stringify ! ( b3JointSensorState ) ));
    assert_eq! (::std::mem::align_of::<b3JointSensorState>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( b3JointSensorState ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointSensorState ) ) . m_jointPosition
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointSensorState ) ,
                "::" , stringify ! ( m_jointPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointSensorState ) ) . m_jointVelocity
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3JointSensorState ) ,
                "::" , stringify ! ( m_jointVelocity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointSensorState ) ) .
                m_jointForceTorque as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! ( b3JointSensorState ) ,
                "::" , stringify ! ( m_jointForceTorque ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3JointSensorState ) ) .
                m_jointMotorTorque as * const _ as usize } , 64usize , concat
                ! (
                "Alignment of field: " , stringify ! ( b3JointSensorState ) ,
                "::" , stringify ! ( m_jointMotorTorque ) ));
}
impl Clone for b3JointSensorState {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3DebugLines {
    pub m_numDebugLines: ::std::os::raw::c_int,
    pub m_linesFrom: *const f32,
    pub m_linesTo: *const f32,
    pub m_linesColor: *const f32,
}
#[test]
fn bindgen_test_layout_b3DebugLines() {
    assert_eq!(::std::mem::size_of::<b3DebugLines>() , 32usize , concat ! (
               "Size of: " , stringify ! ( b3DebugLines ) ));
    assert_eq! (::std::mem::align_of::<b3DebugLines>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3DebugLines ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DebugLines ) ) . m_numDebugLines as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3DebugLines ) , "::" ,
                stringify ! ( m_numDebugLines ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DebugLines ) ) . m_linesFrom as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3DebugLines ) , "::" ,
                stringify ! ( m_linesFrom ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DebugLines ) ) . m_linesTo as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3DebugLines ) , "::" ,
                stringify ! ( m_linesTo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3DebugLines ) ) . m_linesColor as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( b3DebugLines ) , "::" ,
                stringify ! ( m_linesColor ) ));
}
impl Clone for b3DebugLines {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3OverlappingObject {
    pub m_objectUniqueId: ::std::os::raw::c_int,
    pub m_linkIndex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3OverlappingObject() {
    assert_eq!(::std::mem::size_of::<b3OverlappingObject>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( b3OverlappingObject ) ));
    assert_eq! (::std::mem::align_of::<b3OverlappingObject>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3OverlappingObject ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OverlappingObject ) ) .
                m_objectUniqueId as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3OverlappingObject ) ,
                "::" , stringify ! ( m_objectUniqueId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OverlappingObject ) ) . m_linkIndex as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3OverlappingObject ) ,
                "::" , stringify ! ( m_linkIndex ) ));
}
impl Clone for b3OverlappingObject {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3AABBOverlapData {
    pub m_numOverlappingObjects: ::std::os::raw::c_int,
    pub m_overlappingObjects: *mut b3OverlappingObject,
}
#[test]
fn bindgen_test_layout_b3AABBOverlapData() {
    assert_eq!(::std::mem::size_of::<b3AABBOverlapData>() , 16usize , concat !
               ( "Size of: " , stringify ! ( b3AABBOverlapData ) ));
    assert_eq! (::std::mem::align_of::<b3AABBOverlapData>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( b3AABBOverlapData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3AABBOverlapData ) ) .
                m_numOverlappingObjects as * const _ as usize } , 0usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3AABBOverlapData ) ,
                "::" , stringify ! ( m_numOverlappingObjects ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3AABBOverlapData ) ) .
                m_overlappingObjects as * const _ as usize } , 8usize , concat
                ! (
                "Alignment of field: " , stringify ! ( b3AABBOverlapData ) ,
                "::" , stringify ! ( m_overlappingObjects ) ));
}
impl Clone for b3AABBOverlapData {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3CameraImageData {
    pub m_pixelWidth: ::std::os::raw::c_int,
    pub m_pixelHeight: ::std::os::raw::c_int,
    pub m_rgbColorData: *const ::std::os::raw::c_uchar,
    pub m_depthValues: *const f32,
    pub m_segmentationMaskValues: *const ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3CameraImageData() {
    assert_eq!(::std::mem::size_of::<b3CameraImageData>() , 32usize , concat !
               ( "Size of: " , stringify ! ( b3CameraImageData ) ));
    assert_eq! (::std::mem::align_of::<b3CameraImageData>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( b3CameraImageData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3CameraImageData ) ) . m_pixelWidth as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3CameraImageData ) ,
                "::" , stringify ! ( m_pixelWidth ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3CameraImageData ) ) . m_pixelHeight as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3CameraImageData ) ,
                "::" , stringify ! ( m_pixelHeight ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3CameraImageData ) ) . m_rgbColorData as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3CameraImageData ) ,
                "::" , stringify ! ( m_rgbColorData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3CameraImageData ) ) . m_depthValues as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3CameraImageData ) ,
                "::" , stringify ! ( m_depthValues ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3CameraImageData ) ) .
                m_segmentationMaskValues as * const _ as usize } , 24usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3CameraImageData ) ,
                "::" , stringify ! ( m_segmentationMaskValues ) ));
}
impl Clone for b3CameraImageData {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3OpenGLVisualizerCameraInfo {
    pub m_width: ::std::os::raw::c_int,
    pub m_height: ::std::os::raw::c_int,
    pub m_viewMatrix: [f32; 16usize],
    pub m_projectionMatrix: [f32; 16usize],
    pub m_camUp: [f32; 3usize],
    pub m_camForward: [f32; 3usize],
    pub m_horizontal: [f32; 3usize],
    pub m_vertical: [f32; 3usize],
    pub m_yaw: f32,
    pub m_pitch: f32,
    pub m_dist: f32,
    pub m_target: [f32; 3usize],
}
#[test]
fn bindgen_test_layout_b3OpenGLVisualizerCameraInfo() {
    assert_eq!(::std::mem::size_of::<b3OpenGLVisualizerCameraInfo>() ,
               208usize , concat ! (
               "Size of: " , stringify ! ( b3OpenGLVisualizerCameraInfo ) ));
    assert_eq! (::std::mem::align_of::<b3OpenGLVisualizerCameraInfo>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( b3OpenGLVisualizerCameraInfo )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_width as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_width
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_height as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_height
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_viewMatrix as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! (
                m_viewMatrix ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_projectionMatrix as * const _ as usize } , 72usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! (
                m_projectionMatrix ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_camUp as * const _ as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_camUp
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_camForward as * const _ as usize } , 148usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! (
                m_camForward ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_horizontal as * const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! (
                m_horizontal ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_vertical as * const _ as usize } , 172usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! (
                m_vertical ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) . m_yaw
                as * const _ as usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_yaw )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_pitch as * const _ as usize } , 188usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_pitch
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) . m_dist
                as * const _ as usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_dist )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3OpenGLVisualizerCameraInfo ) ) .
                m_target as * const _ as usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3OpenGLVisualizerCameraInfo ) , "::" , stringify ! ( m_target
                ) ));
}
impl Clone for b3OpenGLVisualizerCameraInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum b3VREventType {
    VR_CONTROLLER_MOVE_EVENT = 1,
    VR_CONTROLLER_BUTTON_EVENT = 2,
    VR_HMD_MOVE_EVENT = 4,
    VR_GENERIC_TRACKER_MOVE_EVENT = 8,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum b3VRButtonInfo {
    eButtonIsDown = 1,
    eButtonTriggered = 2,
    eButtonReleased = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eVRDeviceTypeEnums {
    VR_DEVICE_CONTROLLER = 1,
    VR_DEVICE_HMD = 2,
    VR_DEVICE_GENERIC_TRACKER = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum EVRCameraFlags { VR_CAMERA_TRACK_OBJECT_ORIENTATION = 1, }
#[repr(C)]
#[derive(Copy)]
pub struct b3VRControllerEvent {
    pub m_controllerId: ::std::os::raw::c_int,
    pub m_deviceType: ::std::os::raw::c_int,
    pub m_numMoveEvents: ::std::os::raw::c_int,
    pub m_numButtonEvents: ::std::os::raw::c_int,
    pub m_pos: [f32; 4usize],
    pub m_orn: [f32; 4usize],
    pub m_analogAxis: f32,
    pub m_buttons: [::std::os::raw::c_int; 64usize],
}
#[test]
fn bindgen_test_layout_b3VRControllerEvent() {
    assert_eq!(::std::mem::size_of::<b3VRControllerEvent>() , 308usize ,
               concat ! ( "Size of: " , stringify ! ( b3VRControllerEvent )
               ));
    assert_eq! (::std::mem::align_of::<b3VRControllerEvent>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3VRControllerEvent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_controllerId
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_controllerId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_deviceType as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_deviceType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_numMoveEvents
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_numMoveEvents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) .
                m_numButtonEvents as * const _ as usize } , 12usize , concat !
                (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_numButtonEvents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_pos as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_orn as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_orn ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_analogAxis as
                * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_analogAxis ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VRControllerEvent ) ) . m_buttons as *
                const _ as usize } , 52usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VRControllerEvent ) ,
                "::" , stringify ! ( m_buttons ) ));
}
impl Clone for b3VRControllerEvent {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3VREventsData {
    pub m_numControllerEvents: ::std::os::raw::c_int,
    pub m_controllerEvents: *mut b3VRControllerEvent,
}
#[test]
fn bindgen_test_layout_b3VREventsData() {
    assert_eq!(::std::mem::size_of::<b3VREventsData>() , 16usize , concat ! (
               "Size of: " , stringify ! ( b3VREventsData ) ));
    assert_eq! (::std::mem::align_of::<b3VREventsData>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3VREventsData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VREventsData ) ) .
                m_numControllerEvents as * const _ as usize } , 0usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3VREventsData ) , "::"
                , stringify ! ( m_numControllerEvents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VREventsData ) ) . m_controllerEvents
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VREventsData ) , "::"
                , stringify ! ( m_controllerEvents ) ));
}
impl Clone for b3VREventsData {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3KeyboardEvent {
    pub m_keyCode: ::std::os::raw::c_int,
    pub m_keyState: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3KeyboardEvent() {
    assert_eq!(::std::mem::size_of::<b3KeyboardEvent>() , 8usize , concat ! (
               "Size of: " , stringify ! ( b3KeyboardEvent ) ));
    assert_eq! (::std::mem::align_of::<b3KeyboardEvent>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( b3KeyboardEvent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3KeyboardEvent ) ) . m_keyCode as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3KeyboardEvent ) ,
                "::" , stringify ! ( m_keyCode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3KeyboardEvent ) ) . m_keyState as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3KeyboardEvent ) ,
                "::" , stringify ! ( m_keyState ) ));
}
impl Clone for b3KeyboardEvent {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3KeyboardEventsData {
    pub m_numKeyboardEvents: ::std::os::raw::c_int,
    pub m_keyboardEvents: *mut b3KeyboardEvent,
}
#[test]
fn bindgen_test_layout_b3KeyboardEventsData() {
    assert_eq!(::std::mem::size_of::<b3KeyboardEventsData>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( b3KeyboardEventsData )
               ));
    assert_eq! (::std::mem::align_of::<b3KeyboardEventsData>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3KeyboardEventsData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3KeyboardEventsData ) ) .
                m_numKeyboardEvents as * const _ as usize } , 0usize , concat
                ! (
                "Alignment of field: " , stringify ! ( b3KeyboardEventsData )
                , "::" , stringify ! ( m_numKeyboardEvents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3KeyboardEventsData ) ) .
                m_keyboardEvents as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3KeyboardEventsData )
                , "::" , stringify ! ( m_keyboardEvents ) ));
}
impl Clone for b3KeyboardEventsData {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eMouseEventTypeEnums {
    MOUSE_MOVE_EVENT = 1,
    MOUSE_BUTTON_EVENT = 2,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3MouseEvent {
    pub m_eventType: ::std::os::raw::c_int,
    pub m_mousePosX: f32,
    pub m_mousePosY: f32,
    pub m_buttonIndex: ::std::os::raw::c_int,
    pub m_buttonState: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3MouseEvent() {
    assert_eq!(::std::mem::size_of::<b3MouseEvent>() , 20usize , concat ! (
               "Size of: " , stringify ! ( b3MouseEvent ) ));
    assert_eq! (::std::mem::align_of::<b3MouseEvent>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( b3MouseEvent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEvent ) ) . m_eventType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEvent ) , "::" ,
                stringify ! ( m_eventType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEvent ) ) . m_mousePosX as * const
                _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEvent ) , "::" ,
                stringify ! ( m_mousePosX ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEvent ) ) . m_mousePosY as * const
                _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEvent ) , "::" ,
                stringify ! ( m_mousePosY ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEvent ) ) . m_buttonIndex as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEvent ) , "::" ,
                stringify ! ( m_buttonIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEvent ) ) . m_buttonState as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEvent ) , "::" ,
                stringify ! ( m_buttonState ) ));
}
impl Clone for b3MouseEvent {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3MouseEventsData {
    pub m_numMouseEvents: ::std::os::raw::c_int,
    pub m_mouseEvents: *mut b3MouseEvent,
}
#[test]
fn bindgen_test_layout_b3MouseEventsData() {
    assert_eq!(::std::mem::size_of::<b3MouseEventsData>() , 16usize , concat !
               ( "Size of: " , stringify ! ( b3MouseEventsData ) ));
    assert_eq! (::std::mem::align_of::<b3MouseEventsData>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( b3MouseEventsData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEventsData ) ) . m_numMouseEvents
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEventsData ) ,
                "::" , stringify ! ( m_numMouseEvents ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3MouseEventsData ) ) . m_mouseEvents as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3MouseEventsData ) ,
                "::" , stringify ! ( m_mouseEvents ) ));
}
impl Clone for b3MouseEventsData {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3ContactPointData {
    pub m_contactFlags: ::std::os::raw::c_int,
    pub m_bodyUniqueIdA: ::std::os::raw::c_int,
    pub m_bodyUniqueIdB: ::std::os::raw::c_int,
    pub m_linkIndexA: ::std::os::raw::c_int,
    pub m_linkIndexB: ::std::os::raw::c_int,
    pub m_positionOnAInWS: [f64; 3usize],
    pub m_positionOnBInWS: [f64; 3usize],
    pub m_contactNormalOnBInWS: [f64; 3usize],
    pub m_contactDistance: f64,
    pub m_normalForce: f64,
}
#[test]
fn bindgen_test_layout_b3ContactPointData() {
    assert_eq!(::std::mem::size_of::<b3ContactPointData>() , 112usize , concat
               ! ( "Size of: " , stringify ! ( b3ContactPointData ) ));
    assert_eq! (::std::mem::align_of::<b3ContactPointData>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( b3ContactPointData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) . m_contactFlags
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_contactFlags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) . m_bodyUniqueIdA
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_bodyUniqueIdA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) . m_bodyUniqueIdB
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_bodyUniqueIdB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) . m_linkIndexA as
                * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_linkIndexA ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) . m_linkIndexB as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_linkIndexB ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) .
                m_positionOnAInWS as * const _ as usize } , 24usize , concat !
                (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_positionOnAInWS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) .
                m_positionOnBInWS as * const _ as usize } , 48usize , concat !
                (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_positionOnBInWS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) .
                m_contactNormalOnBInWS as * const _ as usize } , 72usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_contactNormalOnBInWS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) .
                m_contactDistance as * const _ as usize } , 96usize , concat !
                (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_contactDistance ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactPointData ) ) . m_normalForce as
                * const _ as usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( b3ContactPointData ) ,
                "::" , stringify ! ( m_normalForce ) ));
}
impl Clone for b3ContactPointData {
    fn clone(&self) -> Self { *self }
}
pub const CONTACT_QUERY_MODE_REPORT_EXISTING_CONTACT_POINTS: _bindgen_ty_2 =
    _bindgen_ty_2::CONTACT_QUERY_MODE_REPORT_EXISTING_CONTACT_POINTS;
pub const CONTACT_QUERY_MODE_COMPUTE_CLOSEST_POINTS: _bindgen_ty_2 =
    _bindgen_ty_2::CONTACT_QUERY_MODE_COMPUTE_CLOSEST_POINTS;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_2 {
    CONTACT_QUERY_MODE_REPORT_EXISTING_CONTACT_POINTS = 0,
    CONTACT_QUERY_MODE_COMPUTE_CLOSEST_POINTS = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum b3StateLoggingType {
    STATE_LOGGING_MINITAUR = 0,
    STATE_LOGGING_GENERIC_ROBOT = 1,
    STATE_LOGGING_VR_CONTROLLERS = 2,
    STATE_LOGGING_VIDEO_MP4 = 3,
    STATE_LOGGING_COMMANDS = 4,
    STATE_LOGGING_CONTACT_POINTS = 5,
    STATE_LOGGING_PROFILE_TIMINGS = 6,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3ContactInformation {
    pub m_numContactPoints: ::std::os::raw::c_int,
    pub m_contactPointData: *mut b3ContactPointData,
}
#[test]
fn bindgen_test_layout_b3ContactInformation() {
    assert_eq!(::std::mem::size_of::<b3ContactInformation>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( b3ContactInformation )
               ));
    assert_eq! (::std::mem::align_of::<b3ContactInformation>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3ContactInformation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactInformation ) ) .
                m_numContactPoints as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! ( b3ContactInformation )
                , "::" , stringify ! ( m_numContactPoints ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3ContactInformation ) ) .
                m_contactPointData as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! ( b3ContactInformation )
                , "::" , stringify ! ( m_contactPointData ) ));
}
impl Clone for b3ContactInformation {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3RayHitInfo {
    pub m_hitFraction: f64,
    pub m_hitObjectUniqueId: ::std::os::raw::c_int,
    pub m_hitObjectLinkIndex: ::std::os::raw::c_int,
    pub m_hitPositionWorld: [f64; 3usize],
    pub m_hitNormalWorld: [f64; 3usize],
}
#[test]
fn bindgen_test_layout_b3RayHitInfo() {
    assert_eq!(::std::mem::size_of::<b3RayHitInfo>() , 64usize , concat ! (
               "Size of: " , stringify ! ( b3RayHitInfo ) ));
    assert_eq! (::std::mem::align_of::<b3RayHitInfo>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3RayHitInfo ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RayHitInfo ) ) . m_hitFraction as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RayHitInfo ) , "::" ,
                stringify ! ( m_hitFraction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RayHitInfo ) ) . m_hitObjectUniqueId as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RayHitInfo ) , "::" ,
                stringify ! ( m_hitObjectUniqueId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RayHitInfo ) ) . m_hitObjectLinkIndex
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RayHitInfo ) , "::" ,
                stringify ! ( m_hitObjectLinkIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RayHitInfo ) ) . m_hitPositionWorld as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RayHitInfo ) , "::" ,
                stringify ! ( m_hitPositionWorld ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RayHitInfo ) ) . m_hitNormalWorld as *
                const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RayHitInfo ) , "::" ,
                stringify ! ( m_hitNormalWorld ) ));
}
impl Clone for b3RayHitInfo {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3RaycastInformation {
    pub m_numRayHits: ::std::os::raw::c_int,
    pub m_rayHits: *mut b3RayHitInfo,
}
#[test]
fn bindgen_test_layout_b3RaycastInformation() {
    assert_eq!(::std::mem::size_of::<b3RaycastInformation>() , 16usize ,
               concat ! ( "Size of: " , stringify ! ( b3RaycastInformation )
               ));
    assert_eq! (::std::mem::align_of::<b3RaycastInformation>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3RaycastInformation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RaycastInformation ) ) . m_numRayHits
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RaycastInformation )
                , "::" , stringify ! ( m_numRayHits ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3RaycastInformation ) ) . m_rayHits as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( b3RaycastInformation )
                , "::" , stringify ! ( m_rayHits ) ));
}
impl Clone for b3RaycastInformation {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Copy)]
pub struct b3VisualShapeData {
    pub m_objectUniqueId: ::std::os::raw::c_int,
    pub m_linkIndex: ::std::os::raw::c_int,
    pub m_visualGeometryType: ::std::os::raw::c_int,
    pub m_dimensions: [f64; 3usize],
    pub m_meshAssetFileName: [::std::os::raw::c_char; 1024usize],
    pub m_localVisualFrame: [f64; 7usize],
    pub m_rgbaColor: [f64; 4usize],
}
#[test]
fn bindgen_test_layout_b3VisualShapeData() {
    assert_eq!(::std::mem::size_of::<b3VisualShapeData>() , 1152usize , concat
               ! ( "Size of: " , stringify ! ( b3VisualShapeData ) ));
    assert_eq! (::std::mem::align_of::<b3VisualShapeData>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( b3VisualShapeData ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) . m_objectUniqueId
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_objectUniqueId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) . m_linkIndex as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_linkIndex ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) .
                m_visualGeometryType as * const _ as usize } , 8usize , concat
                ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_visualGeometryType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) . m_dimensions as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_dimensions ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) .
                m_meshAssetFileName as * const _ as usize } , 40usize , concat
                ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_meshAssetFileName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) .
                m_localVisualFrame as * const _ as usize } , 1064usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_localVisualFrame ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeData ) ) . m_rgbaColor as *
                const _ as usize } , 1120usize , concat ! (
                "Alignment of field: " , stringify ! ( b3VisualShapeData ) ,
                "::" , stringify ! ( m_rgbaColor ) ));
}
impl Clone for b3VisualShapeData {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3VisualShapeInformation {
    pub m_numVisualShapes: ::std::os::raw::c_int,
    pub m_visualShapeData: *mut b3VisualShapeData,
}
#[test]
fn bindgen_test_layout_b3VisualShapeInformation() {
    assert_eq!(::std::mem::size_of::<b3VisualShapeInformation>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( b3VisualShapeInformation ) ));
    assert_eq! (::std::mem::align_of::<b3VisualShapeInformation>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3VisualShapeInformation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeInformation ) ) .
                m_numVisualShapes as * const _ as usize } , 0usize , concat !
                (
                "Alignment of field: " , stringify ! (
                b3VisualShapeInformation ) , "::" , stringify ! (
                m_numVisualShapes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3VisualShapeInformation ) ) .
                m_visualShapeData as * const _ as usize } , 8usize , concat !
                (
                "Alignment of field: " , stringify ! (
                b3VisualShapeInformation ) , "::" , stringify ! (
                m_visualShapeData ) ));
}
impl Clone for b3VisualShapeInformation {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eLinkStateFlags { ACTUAL_STATE_COMPUTE_LINKVELOCITY = 1, }
/// b3LinkState provides extra information such as the Cartesian world coordinates
/// center of mass (COM) of the link, relative to the world reference frame.
/// Orientation is a quaternion x,y,z,w
/// Note: to compute the URDF link frame (which equals the joint frame at joint position 0)
/// use URDF link frame = link COM frame * inertiaFrame.inverse()
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3LinkState {
    pub m_worldPosition: [f64; 3usize],
    pub m_worldOrientation: [f64; 4usize],
    pub m_localInertialPosition: [f64; 3usize],
    pub m_localInertialOrientation: [f64; 4usize],
    /// world position and orientation of the (URDF) link frame
    pub m_worldLinkFramePosition: [f64; 3usize],
    pub m_worldLinkFrameOrientation: [f64; 4usize],
    pub m_worldLinearVelocity: [f64; 3usize],
    pub m_worldAngularVelocity: [f64; 3usize],
    pub m_worldAABBMin: [f64; 3usize],
    pub m_worldAABBMax: [f64; 3usize],
}
#[test]
fn bindgen_test_layout_b3LinkState() {
    assert_eq!(::std::mem::size_of::<b3LinkState>() , 264usize , concat ! (
               "Size of: " , stringify ! ( b3LinkState ) ));
    assert_eq! (::std::mem::align_of::<b3LinkState>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( b3LinkState ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_worldPosition as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_worldOrientation as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldOrientation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_localInertialPosition
                as * const _ as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_localInertialPosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) .
                m_localInertialOrientation as * const _ as usize } , 80usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_localInertialOrientation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) .
                m_worldLinkFramePosition as * const _ as usize } , 112usize ,
                concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldLinkFramePosition ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) .
                m_worldLinkFrameOrientation as * const _ as usize } , 136usize
                , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldLinkFrameOrientation ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_worldLinearVelocity
                as * const _ as usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldLinearVelocity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_worldAngularVelocity
                as * const _ as usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldAngularVelocity ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_worldAABBMin as *
                const _ as usize } , 216usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldAABBMin ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3LinkState ) ) . m_worldAABBMax as *
                const _ as usize } , 240usize , concat ! (
                "Alignment of field: " , stringify ! ( b3LinkState ) , "::" ,
                stringify ! ( m_worldAABBMax ) ));
}
impl Clone for b3LinkState {
    fn clone(&self) -> Self { *self }
}
pub const CONTROL_MODE_VELOCITY: _bindgen_ty_3 =
    _bindgen_ty_3::CONTROL_MODE_VELOCITY;
pub const CONTROL_MODE_TORQUE: _bindgen_ty_3 =
    _bindgen_ty_3::CONTROL_MODE_TORQUE;
pub const CONTROL_MODE_POSITION_VELOCITY_PD: _bindgen_ty_3 =
    _bindgen_ty_3::CONTROL_MODE_POSITION_VELOCITY_PD;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_3 {
    CONTROL_MODE_VELOCITY = 0,
    CONTROL_MODE_TORQUE = 1,
    CONTROL_MODE_POSITION_VELOCITY_PD = 2,
}
#[repr(u32)]
/// flags for b3ApplyExternalTorque and b3ApplyExternalForce
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum EnumExternalForceFlags { EF_LINK_FRAME = 1, EF_WORLD_FRAME = 2, }
#[repr(u32)]
/// flags to pick the renderer for synthetic camera
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum EnumRenderer {
    ER_TINY_RENDERER = 65536,
    ER_BULLET_HARDWARE_OPENGL = 131072,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum b3ConfigureDebugVisualizerEnum {
    COV_ENABLE_GUI = 1,
    COV_ENABLE_SHADOWS = 2,
    COV_ENABLE_WIREFRAME = 3,
    COV_ENABLE_VR_TELEPORTING = 4,
    COV_ENABLE_VR_PICKING = 5,
    COV_ENABLE_VR_RENDER_CONTROLLERS = 6,
    COV_ENABLE_RENDERING = 7,
    COV_ENABLE_SYNC_RENDERING_INTERNAL = 8,
    COV_ENABLE_KEYBOARD_SHORTCUTS = 9,
    COV_ENABLE_MOUSE_PICKING = 10,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum b3AddUserDebugItemEnum {
    DEB_DEBUG_TEXT_USE_ORIENTATION = 1,
    DEB_DEBUG_TEXT_USE_TRUE_TYPE_FONTS = 2,
    DEB_DEBUG_TEXT_HAS_TRACKING_OBJECT = 4,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eCONNECT_METHOD {
    eCONNECT_GUI = 1,
    eCONNECT_DIRECT = 2,
    eCONNECT_SHARED_MEMORY = 3,
    eCONNECT_UDP = 4,
    eCONNECT_TCP = 5,
    eCONNECT_EXISTING_EXAMPLE_BROWSER = 6,
    eCONNECT_GUI_SERVER = 7,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eURDF_Flags {
    URDF_USE_INERTIA_FROM_FILE = 2,
    URDF_USE_SELF_COLLISION = 8,
    URDF_USE_SELF_COLLISION_EXCLUDE_PARENT = 16,
    URDF_USE_SELF_COLLISION_EXCLUDE_ALL_PARENTS = 32,
    URDF_RESERVED = 64,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eUrdfGeomTypes {
    GEOM_SPHERE = 2,
    GEOM_BOX = 3,
    GEOM_CYLINDER = 4,
    GEOM_MESH = 5,
    GEOM_PLANE = 6,
    GEOM_CAPSULE = 7,
    GEOM_UNKNOWN = 8,
    GEOM_TRIMESH = 9,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eUrdfCollisionFlags { GEOM_FORCE_CONCAVE_TRIMESH = 1, }
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum eStateLoggingFlags {
    STATE_LOG_JOINT_MOTOR_TORQUES = 1,
    STATE_LOG_JOINT_USER_TORQUES = 2,
    STATE_LOG_JOINT_TORQUES = 3,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3PhysicsClientHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3PhysicsClientHandle__() {
    assert_eq!(::std::mem::size_of::<b3PhysicsClientHandle__>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( b3PhysicsClientHandle__ ) ));
    assert_eq! (::std::mem::align_of::<b3PhysicsClientHandle__>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( b3PhysicsClientHandle__ ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3PhysicsClientHandle__ ) ) . unused as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( b3PhysicsClientHandle__
                ) , "::" , stringify ! ( unused ) ));
}
impl Clone for b3PhysicsClientHandle__ {
    fn clone(&self) -> Self { *self }
}
pub type b3PhysicsClientHandle = *mut b3PhysicsClientHandle__;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3SharedMemoryCommandHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3SharedMemoryCommandHandle__() {
    assert_eq!(::std::mem::size_of::<b3SharedMemoryCommandHandle__>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( b3SharedMemoryCommandHandle__ ) ));
    assert_eq! (::std::mem::align_of::<b3SharedMemoryCommandHandle__>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( b3SharedMemoryCommandHandle__
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3SharedMemoryCommandHandle__ ) ) .
                unused as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3SharedMemoryCommandHandle__ ) , "::" , stringify ! ( unused
                ) ));
}
impl Clone for b3SharedMemoryCommandHandle__ {
    fn clone(&self) -> Self { *self }
}
pub type b3SharedMemoryCommandHandle = *mut b3SharedMemoryCommandHandle__;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct b3SharedMemoryStatusHandle__ {
    pub unused: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_b3SharedMemoryStatusHandle__() {
    assert_eq!(::std::mem::size_of::<b3SharedMemoryStatusHandle__>() , 4usize
               , concat ! (
               "Size of: " , stringify ! ( b3SharedMemoryStatusHandle__ ) ));
    assert_eq! (::std::mem::align_of::<b3SharedMemoryStatusHandle__>() ,
                4usize , concat ! (
                "Alignment of " , stringify ! ( b3SharedMemoryStatusHandle__ )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const b3SharedMemoryStatusHandle__ ) ) . unused
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                b3SharedMemoryStatusHandle__ ) , "::" , stringify ! ( unused )
                ));
}
impl Clone for b3SharedMemoryStatusHandle__ {
    fn clone(&self) -> Self { *self }
}
pub type b3SharedMemoryStatusHandle = *mut b3SharedMemoryStatusHandle__;
extern "C" {
    pub fn b3ConnectSharedMemory(key: ::std::os::raw::c_int)
     -> b3PhysicsClientHandle;
}
extern "C" {
    pub fn b3ConnectSharedMemory2(key: ::std::os::raw::c_int)
     -> b3PhysicsClientHandle;
}
extern "C" {
    /// think more about naming. Directly execute commands without transport (no shared memory, UDP, socket, grpc etc)
    pub fn b3ConnectPhysicsDirect() -> b3PhysicsClientHandle;
}
extern "C" {
